embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
#include "core_cm0plus.h"            /* Cortex-M0+ processor and core peripherals */
#include <stdint.h>

/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined (__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
#pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning 586
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Peripheral_registers_structures
  * @{
  */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct memory access controller (DMA)
  */

typedef struct                                  /*!< DMA Structure                                                             */
{
  __IO uint32_t  ISR;                          /*!< (@ 0x00000000) Interrupt status register                                  */
  __IO uint32_t  IFCR;                         /*!< (@ 0x00000004) Interrupt flag clear register                              */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CCR;         /*!< DMA channel x configuration register        */
  __IO uint32_t CNDTR;       /*!< DMA channel x number of data register       */
  __IO uint32_t CPAR;        /*!< DMA channel x peripheral address register   */
  __IO uint32_t CMAR;        /*!< DMA channel x memory address register       */
  __IO uint32_t RESERVED;
} DMA_Channel_TypeDef;


/* =========================================================================================================================== */
/* ================                                          DMAMUX                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Direct memory access Multiplexer (DMAMUX)
  */

/**
  * @brief DMA Multiplexer
  */
typedef struct               /*!< DMAMUX Structure                                                                   */
{
  __IO uint32_t   CxCR;       /*!< DMA Multiplexer Channel x Control Register    Address offset: 0x0004 * (channel x) */
} DMAMUX_Channel_TypeDef;


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic redundancy check calculation unit (CRC)
  */

typedef struct                                  /*!< CRC Structure                                                             */
{
  __IO uint32_t  DR;                           /*!< (@ 0x00000000) Data register                                              */
  __IO uint32_t  IDR;                          /*!< (@ 0x00000004) Independent data register                                  */
  __IO uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IO uint32_t  RESERVED;
  __IO uint32_t  INIT;                         /*!< (@ 0x00000010) Initial CRC value                                          */
  __IO uint32_t  POL;                          /*!< (@ 0x00000014) Polynomial                                                 */
} CRC_TypeDef;                                  /*!< Size = 24 (0x18)                                                          */


/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct                                  /*!< IWDG Structure                                                            */
{
  __IO uint32_t  KR;                           /*!< (@ 0x00000000) Key register                                               */
  __IO uint32_t  PR;                           /*!< (@ 0x00000004) Prescaler register                                         */
  __IO uint32_t  RLR;                          /*!< (@ 0x00000008) Reload register                                            */
  __IO uint32_t  SR;                           /*!< (@ 0x0000000C) Status register                                            */
  __IO uint32_t  WINR;                         /*!< (@ 0x00000010) Window register                                            */
} IWDG_TypeDef;                                 /*!< Size = 20 (0x14)                                                          */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C)
  */

typedef struct                                  /*!< I2C Structure                                                             */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  OAR1;                         /*!< (@ 0x00000008) Own address register 1                                     */
  __IO uint32_t  OAR2;                         /*!< (@ 0x0000000C) Own address register 2                                     */
  __IO uint32_t  TIMINGR;                      /*!< (@ 0x00000010) Timing register                                            */
  __IO uint32_t  TIMEOUTR;                     /*!< (@ 0x00000014) Timeout register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x00000018) Interrupt and Status register                              */
  __IO uint32_t  ICR;                          /*!< (@ 0x0000001C) Interrupt clear register                                   */
  __IO uint32_t  PECR;                         /*!< (@ 0x00000020) PEC register                                               */
  __IO uint32_t  RXDR;                         /*!< (@ 0x00000024) Receive data register                                      */
  __IO uint32_t  TXDR;                         /*!< (@ 0x00000028) Transmit data register                                     */
} I2C_TypeDef;                                  /*!< Size = 44 (0x2c)                                                          */


/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief FLASH (FLASH)
  */

