embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
typedef struct  /*!< FLASH Structure  */
{
  __IO uint32_t COMMAND;       /*!< (@ 0x00000000) COMMAND register            */
  __IO uint32_t CONFIG;        /*!< (@ 0x00000004) CONFIG register             */
  __IO uint32_t IRQSTAT;       /*!< (@ 0x00000008) IRQSTAT register            */
  __IO uint32_t IRQMASK;       /*!< (@ 0x0000000C) IRQMASK register            */
  __IO uint32_t IRQRAW;        /*!< (@ 0x00000010) IRQRAW register             */
  __IO uint32_t SIZE;          /*!< (@ 0x00000014) SIZE register               */
  __IO uint32_t ADDRESS;       /*!< (@ 0x00000018) ADDRESS register            */
  __IO uint32_t RESERVED[2];
  __IO uint32_t LFSRVAL;       /*!< (@ 0x00000024) LFSRVAL register            */
  __IO uint32_t RESERVED2[3];
  __IO uint32_t PAGEPROT0;     /*!< (@ 0x00000034) PAGEPROT0 register          */
  __IO uint32_t PAGEPROT1;     /*!< (@ 0x00000038) PAGEPROT1 register          */
  __IO uint32_t RESERVED1;
  __IO uint32_t DATA0;         /*!< (@ 0x00000040) DATA0 register              */
  __IO uint32_t DATA1;         /*!< (@ 0x00000044) DATA1 register              */
  __IO uint32_t DATA2;         /*!< (@ 0x00000048) DATA2 register              */
  __IO uint32_t DATA3;         /*!< (@ 0x0000004C) DATA3 register              */
} FLASH_TypeDef;                  /*!< Size = 80 (0x50) */


/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface/Inter-IC sound (SPI)
  */

typedef struct                                  /*!< SPI  Structure                                                            */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SR;                           /*!< (@ 0x00000008) Status register                                            */
  __IO uint32_t  DR;                           /*!< (@ 0x0000000C) Data register                                              */
  __IO uint32_t  CRCPR;                        /*!< (@ 0x00000010) CRC polynomial register                                    */
  __IO uint32_t  RXCRCR;                       /*!< (@ 0x00000014) RX CRC register                                            */
  __IO uint32_t  TXCRCR;                       /*!< (@ 0x00000018) TX CRC register                                            */
  __IO uint32_t  I2SCFGR;                      /*!< (@ 0x0000001C) I2S configuration register                                 */
  __IO uint32_t  I2SPR;                        /*!< (@ 0x00000020) I2S prescaler register                                     */
} SPI_TypeDef;                                  /*!< Size = 36 (0x24)                                                          */


/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct                                  /*!< RCC Structure                                                             */
{
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Clock control register                                     */
  __IO uint32_t  ICSCR;                        /*!< (@ 0x00000004) Internal clock sources calibration register                */
  __IO uint32_t  CFGR;                         /*!< (@ 0x00000008) Clock configuration register                               */
  __IO uint32_t  CSSWCR;                       /*!< (@ 0x0000000C) Clocks Sources Software Calibration register               */
  __IO uint32_t  RESERVED[2];
  __IO uint32_t  CIER;                         /*!< (@ 0x00000018) Clock interrupt enable register                            */
  __IO uint32_t  CIFR;                         /*!< (@ 0x0000001C) Clock interrupt flag register                              */
  __IO uint32_t  CSCMDR;                       /*!< (@ 0x00000020) Clock Switch Command register                              */
  __IO uint32_t  RESERVED1[3];
  __IO uint32_t  AHBRSTR;                      /*!< (@ 0x00000030) AHB0 macro cells reset register                            */
  __IO uint32_t  APB0RSTR;                     /*!< (@ 0x00000034) APB0 macro cells reset register                            */
  __IO uint32_t  APB1RSTR;                     /*!< (@ 0x00000038) APB1 peripheral reset register 1                           */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  APB2RSTR;                     /*!< (@ 0x00000040) APB2 peripheral reset register 2                           */
  __IO uint32_t  RESERVED3[3];
  __IO uint32_t  AHBENR;                       /*!< (@ 0x00000050) AHB0 macro cells clock enable register                     */
  __IO uint32_t  APB0ENR;                      /*!< (@ 0x00000054) APB0 macro cells clock enable register                     */
  __IO uint32_t  APB1ENR;                      /*!< (@ 0x00000058) APB1ENR1                                                   */
  __IO uint32_t  RESERVED4;
  __IO uint32_t  APB2ENR;                      /*!< (@ 0x00000060) APB2ENR                                                    */
  __IO uint32_t  RESERVED5[12];
  __IO uint32_t  CSR;                          /*!< (@ 0x00000094) CSR                                                        */
  __IO uint32_t  RFSWHSECR;                    /*!< (@ 0x00000098) RF Software High Speed External register                   */
  __IO uint32_t  RFHSECR;                      /*!< (@ 0x0000009C) RF High Speed External register                            */
} RCC_TypeDef;                                  /*!< Size = 160 (0xA0)                                                         */


/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct  /*!< PWR Structure  */
{
  __IO uint32_t CR1;       /*!< (@ 0x00000000) CR1 register                 */
  __IO uint32_t CR2;       /*!< (@ 0x00000004) CR2 register                 */
  __IO uint32_t CR3;       /*!< (@ 0x00000008) CR3 register                 */
  __IO uint32_t CR4;       /*!< (@ 0x0000000C) CR4 register                 */
  __IO uint32_t SR1;       /*!< (@ 0x00000010) SR1 register                 */
  __IO uint32_t SR2;       /*!< (@ 0x00000014) SR2 register                 */
  __IO uint32_t RESERVED;
  __IO uint32_t CR5;       /*!< (@ 0x0000001C) CR5 register                 */
  __IO uint32_t PUCRA;     /*!< (@ 0x00000020) PUCRA register               */
  __IO uint32_t PDCRA;     /*!< (@ 0x00000024) PDCRA register               */
  __IO uint32_t PUCRB;     /*!< (@ 0x00000028) PUCRB register               */
  __IO uint32_t PDCRB;     /*!< (@ 0x0000002C) PDCRB register               */
  __IO uint32_t CR6;       /*!< (@ 0x00000030) CR6 register                 */
  __IO uint32_t CR7;       /*!< (@ 0x00000034) CR7 register                 */
  __IO uint32_t SR3;       /*!< (@ 0x00000038) SR3 register                 */
  __IO uint32_t SDWN_WUEN; /*!< (@ 0x0000003C) SDWN_WUEN register           */
  __IO uint32_t SDWN_WUPOL;/*!< (@ 0x00000040) SDWN_WUPOL register          */
  __IO uint32_t SDWN_WUF;  /*!< (@ 0x00000044) SDWN_WUF register            */
  __IO uint32_t RESERVED1[15];
  __IO uint32_t DBGR;      /*!< (@ 0x00000084) DBGR register                */
  __IO uint32_t EXTSRR;    /*!< (@ 0x00000088) EXTSRR register              */
  __IO uint32_t RESERVED2;
  __IO uint32_t TRIMR;     /*!< (@ 0x00000090) TRIMR register               */
  __IO uint32_t ENGTRIM;   /*!< (@ 0x00000094) ENGTRIM register             */
} PWR_TypeDef;              /*!< Size = 152 (0x98) */


/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct                                  /*!< SYSCFG Structure                                                                        */
{
  __IO uint32_t  DIE_ID;                       /*!< (@ 0x00000000) This register provides the device version and cut information            */
  __IO uint32_t  JTAG_ID;                      /*!< (@ 0x00000004) This register provides the JTAG ID of the stm32wb09.                     */
  __IO uint32_t  I2C_FMP_CTRL;                 /*!< (@ 0x00000008) This register allows activating the Fast-mode
                                                                    plus driving capability on I2C open-drain pads                           */
  __IO uint32_t  IO_DTR;                       /*!< (@ 0x0000000C) I/O Interrupt detection type register                                    */
  __IO uint32_t  IO_IBER;                      /*!< (@ 0x00000010) I/O Interrupt Edge register                                              */
  __IO uint32_t  IO_IEVR;                      /*!< (@ 0x00000014) I/O Interrupt polarity event register                                    */
  __IO uint32_t  IO_IER;                       /*!< (@ 0x00000018) I/O Interrupt Enable register                                            */
  __IO uint32_t  IO_ISCR;                      /*!< (@ 0x0000001C) I/O Interrupt Status and Clear register                                  */
  __IO uint32_t  PWRC_IER;                     /*!< (@ 0x00000020) Power Controller Interrupt Enable register                               */
  __IO uint32_t  PWRC_ISCR;                    /*!< (@ 0x00000024) Power Controller Interrupt Status and Clear register                     */
  __IO uint32_t  RESERVED;                     /*!< (@ 0x00000028)                                                                          */
  __IO uint32_t  BLERXTX_DTR;                  /*!< (@ 0x0000002C) MR_BLE RX or TX sequence information detection type register             */
  __IO uint32_t  BLERXTX_IBER;                 /*!< (@ 0x00000030) MR_BLE RX or TX sequence information detection type register             */
  __IO uint32_t  BLERXTX_IEVR;                 /*!< (@ 0x00000034) MR_BLE RX or TX sequence information detection event register            */
  __IO uint32_t  BLERXTX_IER;                  /*!< (@ 0x00000038) MR_BLE RX or TX Interrupt Enable Register                                */
  __IO uint32_t  BLERXTX_ISCR;                 /*!< (@ 0x0000003C) MR_BLE RX or TX sequence information detection status and clear register */
} SYSCFG_TypeDef;                               /*!< Size = 64 (0x40)                                                          */


/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

