embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    AHBRSTR    ===================================================== */
#define RCC_AHBRSTR_RNGRST_Pos                                             (18UL)   /*!<RCC AHBRSTR: RNGRST (Bit 18) */
#define RCC_AHBRSTR_RNGRST_Msk                                             (0x40000UL)    /*!< RCC AHBRSTR: RNGRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_RNGRST                                                 RCC_AHBRSTR_RNGRST_Msk
#define RCC_AHBRSTR_PKARST_Pos                                             (16UL)   /*!<RCC AHBRSTR: PKARST (Bit 16) */
#define RCC_AHBRSTR_PKARST_Msk                                             (0x10000UL)    /*!< RCC AHBRSTR: PKARST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_PKARST                                                 RCC_AHBRSTR_PKARST_Msk
#define RCC_AHBRSTR_CRCRST_Pos                                             (12UL)   /*!<RCC AHBRSTR: CRCRST (Bit 12) */
#define RCC_AHBRSTR_CRCRST_Msk                                             (0x1000UL)   /*!< RCC AHBRSTR: CRCRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_CRCRST                                                 RCC_AHBRSTR_CRCRST_Msk
#define RCC_AHBRSTR_GPIOBRST_Pos                                           (3UL)    /*!<RCC AHBRSTR: GPIOBRST (Bit 3) */
#define RCC_AHBRSTR_GPIOBRST_Msk                                           (0x8UL)    /*!< RCC AHBRSTR: GPIOBRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_GPIOBRST                                               RCC_AHBRSTR_GPIOBRST_Msk
#define RCC_AHBRSTR_GPIOARST_Pos                                           (2UL)    /*!<RCC AHBRSTR: GPIOARST (Bit 2) */
#define RCC_AHBRSTR_GPIOARST_Msk                                           (0x4UL)    /*!< RCC AHBRSTR: GPIOARST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_GPIOARST                                               RCC_AHBRSTR_GPIOARST_Msk
#define RCC_AHBRSTR_DMARST_Pos                                             (0UL)    /*!<RCC AHBRSTR: DMARST (Bit 0) */
#define RCC_AHBRSTR_DMARST_Msk                                             (0x1UL)    /*!< RCC AHBRSTR: DMARST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_DMARST                                                 RCC_AHBRSTR_DMARST_Msk

/* =====================================================    APB0RSTR    ===================================================== */
#define RCC_APB0RSTR_WDGRST_Pos                                            (14UL)   /*!<RCC APB0RSTR: WDGRST (Bit 14) */
#define RCC_APB0RSTR_WDGRST_Msk                                            (0x4000UL)   /*!< RCC APB0RSTR: WDGRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_WDGRST                                                RCC_APB0RSTR_WDGRST_Msk
#define RCC_APB0RSTR_RTCRST_Pos                                            (12UL)   /*!<RCC APB0RSTR: RTCRST (Bit 12) */
#define RCC_APB0RSTR_RTCRST_Msk                                            (0x1000UL)   /*!< RCC APB0RSTR: RTCRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_RTCRST                                                RCC_APB0RSTR_RTCRST_Msk
#define RCC_APB0RSTR_SYSCFGRST_Pos                                         (8UL)    /*!<RCC APB0RSTR: SYSCFGRST (Bit 8) */
#define RCC_APB0RSTR_SYSCFGRST_Msk                                         (0x100UL)    /*!< RCC APB0RSTR: SYSCFGRST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_SYSCFGRST                                             RCC_APB0RSTR_SYSCFGRST_Msk
#define RCC_APB0RSTR_TIM17RST_Pos                                          (2UL)    /*!<RCC APB0RSTR: TIM17RST (Bit 2) */
#define RCC_APB0RSTR_TIM17RST_Msk                                          (0x4UL)    /*!< RCC APB0RSTR: TIM17RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM17RST                                              RCC_APB0RSTR_TIM17RST_Msk
#define RCC_APB0RSTR_TIM16RST_Pos                                          (1UL)    /*!<RCC APB0RSTR: TIM16RST (Bit 1) */
#define RCC_APB0RSTR_TIM16RST_Msk                                          (0x2UL)    /*!< RCC APB0RSTR: TIM16RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM16RST                                              RCC_APB0RSTR_TIM16RST_Msk
#define RCC_APB0RSTR_TIM2RST_Pos                                           (0UL)    /*!<RCC APB0RSTR: TIM2RST (Bit 0) */
#define RCC_APB0RSTR_TIM2RST_Msk                                           (0x1UL)    /*!< RCC APB0RSTR: TIM2RST (Bitfield-Mask: 0x01) */
#define RCC_APB0RSTR_TIM2RST                                               RCC_APB0RSTR_TIM2RST_Msk

/* =====================================================    APB1RSTR    ===================================================== */
#define RCC_APB1RSTR_I2C1RST_Pos                                           (21UL)   /*!<RCC APB1RSTR: I2C1RST (Bit 21) */
#define RCC_APB1RSTR_I2C1RST_Msk                                           (0x200000UL)   /*!< RCC APB1RSTR: I2C1RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_I2C1RST                                               RCC_APB1RSTR_I2C1RST_Msk
#define RCC_APB1RSTR_SPI3RST_Pos                                           (14UL)   /*!<RCC APB1RSTR: SPI3RST (Bit 14) */
#define RCC_APB1RSTR_SPI3RST_Msk                                           (0x4000UL)   /*!< RCC APB1RSTR: SPI3RST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_SPI3RST                                               RCC_APB1RSTR_SPI3RST_Msk
#define RCC_APB1RSTR_USARTRST_Pos                                          (10UL)   /*!<RCC APB1RSTR: USARTRST (Bit 10) */
#define RCC_APB1RSTR_USARTRST_Msk                                          (0x400UL)    /*!< RCC APB1RSTR: USARTRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_USARTRST                                              RCC_APB1RSTR_USARTRST_Msk
#define RCC_APB1RSTR_LPUARTRST_Pos                                         (8UL)    /*!<RCC APB1RSTR: LPUARTRST (Bit 8) */
#define RCC_APB1RSTR_LPUARTRST_Msk                                         (0x100UL)    /*!< RCC APB1RSTR: LPUARTRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_LPUARTRST                                             RCC_APB1RSTR_LPUARTRST_Msk
#define RCC_APB1RSTR_ADCRST_Pos                                            (4UL)    /*!<RCC APB1RSTR: ADCRST (Bit 4) */
#define RCC_APB1RSTR_ADCRST_Msk                                            (0x10UL)   /*!< RCC APB1RSTR: ADCRST (Bitfield-Mask: 0x01) */
#define RCC_APB1RSTR_ADCRST                                                RCC_APB1RSTR_ADCRST_Msk

/* =====================================================    APB2RSTR    ===================================================== */
#define RCC_APB2RSTR_MRBLERST_Pos                                          (0UL)    /*!<RCC APB2RSTR: MRBLERST (Bit 0) */
#define RCC_APB2RSTR_MRBLERST_Msk                                          (0x1UL)    /*!< RCC APB2RSTR: MRBLERST (Bitfield-Mask: 0x01) */
#define RCC_APB2RSTR_MRBLERST                                              RCC_APB2RSTR_MRBLERST_Msk

/* =====================================================    AHBENR    ===================================================== */
#define RCC_AHBENR_RNGEN_Pos                                               (18UL)   /*!<RCC AHBENR: RNGEN (Bit 18) */
#define RCC_AHBENR_RNGEN_Msk                                               (0x40000UL)    /*!< RCC AHBENR: RNGEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_RNGEN                                                   RCC_AHBENR_RNGEN_Msk
#define RCC_AHBENR_PKAEN_Pos                                               (16UL)   /*!<RCC AHBENR: PKAEN (Bit 16) */
#define RCC_AHBENR_PKAEN_Msk                                               (0x10000UL)    /*!< RCC AHBENR: PKAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_PKAEN                                                   RCC_AHBENR_PKAEN_Msk
#define RCC_AHBENR_CRCEN_Pos                                               (12UL)   /*!<RCC AHBENR: CRCEN (Bit 12) */
#define RCC_AHBENR_CRCEN_Msk                                               (0x1000UL)   /*!< RCC AHBENR: CRCEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_CRCEN                                                   RCC_AHBENR_CRCEN_Msk
#define RCC_AHBENR_GPIOBEN_Pos                                             (3UL)    /*!<RCC AHBENR: GPIOBEN (Bit 3) */
#define RCC_AHBENR_GPIOBEN_Msk                                             (0x8UL)    /*!< RCC AHBENR: GPIOBEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_GPIOBEN                                                 RCC_AHBENR_GPIOBEN_Msk
#define RCC_AHBENR_GPIOAEN_Pos                                             (2UL)    /*!<RCC AHBENR: GPIOAEN (Bit 2) */
#define RCC_AHBENR_GPIOAEN_Msk                                             (0x4UL)    /*!< RCC AHBENR: GPIOAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_GPIOAEN                                                 RCC_AHBENR_GPIOAEN_Msk
#define RCC_AHBENR_DMAEN_Pos                                               (0UL)    /*!<RCC AHBENR: DMAEN (Bit 0) */
#define RCC_AHBENR_DMAEN_Msk                                               (0x1UL)    /*!< RCC AHBENR: DMAEN (Bitfield-Mask: 0x01) */
#define RCC_AHBENR_DMAEN                                                   RCC_AHBENR_DMAEN_Msk

/* =====================================================    APB0ENR    ===================================================== */
#define RCC_APB0ENR_WDGEN_Pos                                              (14UL)   /*!<RCC APB0ENR: WDGEN (Bit 14) */
#define RCC_APB0ENR_WDGEN_Msk                                              (0x4000UL)   /*!< RCC APB0ENR: WDGEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_WDGEN                                                  RCC_APB0ENR_WDGEN_Msk
#define RCC_APB0ENR_RTCEN_Pos                                              (12UL)   /*!<RCC APB0ENR: RTCEN (Bit 12) */
#define RCC_APB0ENR_RTCEN_Msk                                              (0x1000UL)   /*!< RCC APB0ENR: RTCEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_RTCEN                                                  RCC_APB0ENR_RTCEN_Msk
#define RCC_APB0ENR_SYSCFGEN_Pos                                           (8UL)    /*!<RCC APB0ENR: SYSCFGEN (Bit 8) */
#define RCC_APB0ENR_SYSCFGEN_Msk                                           (0x100UL)    /*!< RCC APB0ENR: SYSCFGEN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_SYSCFGEN                                               RCC_APB0ENR_SYSCFGEN_Msk
#define RCC_APB0ENR_TIM17EN_Pos                                            (2UL)    /*!<RCC APB0ENR: TIM17EN (Bit 2) */
#define RCC_APB0ENR_TIM17EN_Msk                                            (0x4UL)    /*!< RCC APB0ENR: TIM17EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM17EN                                                RCC_APB0ENR_TIM17EN_Msk
#define RCC_APB0ENR_TIM16EN_Pos                                            (1UL)    /*!<RCC APB0ENR: TIM16EN (Bit 1) */
#define RCC_APB0ENR_TIM16EN_Msk                                            (0x2UL)    /*!< RCC APB0ENR: TIM16EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM16EN                                                RCC_APB0ENR_TIM16EN_Msk
#define RCC_APB0ENR_TIM2EN_Pos                                             (0UL)    /*!<RCC APB0ENR: TIM2EN (Bit 0) */
#define RCC_APB0ENR_TIM2EN_Msk                                             (0x1UL)    /*!< RCC APB0ENR: TIM2EN (Bitfield-Mask: 0x01) */
#define RCC_APB0ENR_TIM2EN                                                 RCC_APB0ENR_TIM2EN_Msk

