embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    SR1    =====================================================*/
#define PWR_SR1_IWUF_Pos                                                   (15UL)   /*!<PWR SR1: IWUF (Bit 15) */
#define PWR_SR1_IWUF_Msk                                                   (0x8000UL)   /*!< PWR SR1: IWUF (Bitfield-Mask: 0x01) */
#define PWR_SR1_IWUF                                                       PWR_SR1_IWUF_Msk
#define PWR_SR1_IWUF2_Pos                                                  (14UL)   /*!<PWR SR1: IWUF2 (Bit 14) */
#define PWR_SR1_IWUF2_Msk                                                  (0x4000UL)   /*!< PWR SR1: IWUF2 (Bitfield-Mask: 0x01) */
#define PWR_SR1_IWUF2                                                      PWR_SR1_IWUF2_Msk
#define PWR_SR1_WBLEHCPUF_Pos                                              (13UL)   /*!<PWR SR1: WBLEHCPUF (Bit 13) */
#define PWR_SR1_WBLEHCPUF_Msk                                              (0x2000UL)   /*!< PWR SR1: WBLEHCPUF (Bitfield-Mask: 0x01) */
#define PWR_SR1_WBLEHCPUF                                                  PWR_SR1_WBLEHCPUF_Msk
#define PWR_SR1_WBLEF_Pos                                                  (12UL)   /*!<PWR SR1: WBLEF (Bit 12) */
#define PWR_SR1_WBLEF_Msk                                                  (0x1000UL)   /*!< PWR SR1: WBLEF (Bitfield-Mask: 0x01) */
#define PWR_SR1_WBLEF                                                      PWR_SR1_WBLEF_Msk
#define PWR_SR1_WUF11_Pos                                                  (11UL)   /*!<PWR SR1: WUF11 (Bit 11) */
#define PWR_SR1_WUF11_Msk                                                  (0x800UL)    /*!< PWR SR1: WUF11 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF11                                                      PWR_SR1_WUF11_Msk
#define PWR_SR1_WUF10_Pos                                                  (10UL)   /*!<PWR SR1: WUF10 (Bit 10) */
#define PWR_SR1_WUF10_Msk                                                  (0x400UL)    /*!< PWR SR1: WUF10 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF10                                                      PWR_SR1_WUF10_Msk
#define PWR_SR1_WUF9_Pos                                                   (9UL)    /*!<PWR SR1: WUF9 (Bit 9) */
#define PWR_SR1_WUF9_Msk                                                   (0x200UL)    /*!< PWR SR1: WUF9 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF9                                                       PWR_SR1_WUF9_Msk
#define PWR_SR1_WUF8_Pos                                                   (8UL)    /*!<PWR SR1: WUF8 (Bit 8) */
#define PWR_SR1_WUF8_Msk                                                   (0x100UL)    /*!< PWR SR1: WUF8 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF8                                                       PWR_SR1_WUF8_Msk
#define PWR_SR1_WUF7_Pos                                                   (7UL)    /*!<PWR SR1: WUF7 (Bit 7) */
#define PWR_SR1_WUF7_Msk                                                   (0x80UL)   /*!< PWR SR1: WUF7 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF7                                                       PWR_SR1_WUF7_Msk
#define PWR_SR1_WUF6_Pos                                                   (6UL)    /*!<PWR SR1: WUF6 (Bit 6) */
#define PWR_SR1_WUF6_Msk                                                   (0x40UL)   /*!< PWR SR1: WUF6 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF6                                                       PWR_SR1_WUF6_Msk
#define PWR_SR1_WUF5_Pos                                                   (5UL)    /*!<PWR SR1: WUF5 (Bit 5) */
#define PWR_SR1_WUF5_Msk                                                   (0x20UL)   /*!< PWR SR1: WUF5 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF5                                                       PWR_SR1_WUF5_Msk
#define PWR_SR1_WUF4_Pos                                                   (4UL)    /*!<PWR SR1: WUF4 (Bit 4) */
#define PWR_SR1_WUF4_Msk                                                   (0x10UL)   /*!< PWR SR1: WUF4 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF4                                                       PWR_SR1_WUF4_Msk
#define PWR_SR1_WUF3_Pos                                                   (3UL)    /*!<PWR SR1: WUF3 (Bit 3) */
#define PWR_SR1_WUF3_Msk                                                   (0x8UL)    /*!< PWR SR1: WUF3 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF3                                                       PWR_SR1_WUF3_Msk
#define PWR_SR1_WUF2_Pos                                                   (2UL)    /*!<PWR SR1: WUF2 (Bit 2) */
#define PWR_SR1_WUF2_Msk                                                   (0x4UL)    /*!< PWR SR1: WUF2 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF2                                                       PWR_SR1_WUF2_Msk
#define PWR_SR1_WUF1_Pos                                                   (1UL)    /*!<PWR SR1: WUF1 (Bit 1) */
#define PWR_SR1_WUF1_Msk                                                   (0x2UL)    /*!< PWR SR1: WUF1 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF1                                                       PWR_SR1_WUF1_Msk
#define PWR_SR1_WUF0_Pos                                                   (0UL)    /*!<PWR SR1: WUF0 (Bit 0) */
#define PWR_SR1_WUF0_Msk                                                   (0x1UL)    /*!< PWR SR1: WUF0 (Bitfield-Mask: 0x01) */
#define PWR_SR1_WUF0                                                       PWR_SR1_WUF0_Msk

/* =====================================================    SR2    =====================================================*/
#define PWR_SR2_IOBOOTVAL_Pos                                              (12UL)   /*!<PWR SR2: IOBOOTVAL (Bit 12) */
#define PWR_SR2_IOBOOTVAL_Msk                                              (0xf000UL)   /*!< PWR SR2: IOBOOTVAL (Bitfield-Mask: 0x0f) */
#define PWR_SR2_IOBOOTVAL                                                  PWR_SR2_IOBOOTVAL_Msk
#define PWR_SR2_IOBOOTVAL_0                                                (0x1U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_1                                                (0x2U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_2                                                (0x4U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_3                                                (0x8U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_PVDO_Pos                                                   (11UL)   /*!<PWR SR2: PVDO (Bit 11) */
#define PWR_SR2_PVDO_Msk                                                   (0x800UL)    /*!< PWR SR2: PVDO (Bitfield-Mask: 0x01) */
#define PWR_SR2_PVDO                                                       PWR_SR2_PVDO_Msk
#define PWR_SR2_REGLPS_Pos                                                 (8UL)    /*!<PWR SR2: REGLPS (Bit 8) */
#define PWR_SR2_REGLPS_Msk                                                 (0x100UL)    /*!< PWR SR2: REGLPS (Bitfield-Mask: 0x01) */
#define PWR_SR2_REGLPS                                                     PWR_SR2_REGLPS_Msk
#define PWR_SR2_IOBOOTVAL2_Pos                                             (4UL)    /*!<PWR SR2: IOBOOTVAL2 (Bit 4) */
#define PWR_SR2_IOBOOTVAL2_Msk                                             (0xf0UL)   /*!< PWR SR2: IOBOOTVAL2 (Bitfield-Mask: 0x0f) */
#define PWR_SR2_IOBOOTVAL2                                                 PWR_SR2_IOBOOTVAL2_Msk
#define PWR_SR2_IOBOOTVAL2_0                                               (0x1U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_1                                               (0x2U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_2                                               (0x4U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_3                                               (0x8U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_SMPSRDY_Pos                                                (2UL)    /*!<PWR SR2: SMPSRDY (Bit 2) */
#define PWR_SR2_SMPSRDY_Msk                                                (0x4UL)    /*!< PWR SR2: SMPSRDY (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSRDY                                                    PWR_SR2_SMPSRDY_Msk
#define PWR_SR2_SMPSENR_Pos                                                (1UL)    /*!<PWR SR2: SMPSENR (Bit 1) */
#define PWR_SR2_SMPSENR_Msk                                                (0x2UL)    /*!< PWR SR2: SMPSENR (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSENR                                                    PWR_SR2_SMPSENR_Msk
#define PWR_SR2_SMPSBYPR_Pos                                               (0UL)    /*!<PWR SR2: SMPSBYPR (Bit 0) */
#define PWR_SR2_SMPSBYPR_Msk                                               (0x1UL)    /*!< PWR SR2: SMPSBYPR (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSBYPR                                                   PWR_SR2_SMPSBYPR_Msk

/* =====================================================    CR5    =====================================================*/
#define PWR_CR5_SMPS_PRECH_CUR_SEL_Pos                                     (13UL)   /*!<PWR CR5: SMPS_PRECH_CUR_SEL (Bit 13) */
#define PWR_CR5_SMPS_PRECH_CUR_SEL_Msk                                     (0x6000UL)   /*!< PWR CR5: SMPS_PRECH_CUR_SEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPS_PRECH_CUR_SEL                                         PWR_CR5_SMPS_PRECH_CUR_SEL_Msk
#define PWR_CR5_SMPS_PRECH_CUR_SEL_0                                       (0x1U << PWR_CR5_SMPS_PRECH_CUR_SEL_Pos)
#define PWR_CR5_SMPS_PRECH_CUR_SEL_1                                       (0x2U << PWR_CR5_SMPS_PRECH_CUR_SEL_Pos)
#define PWR_CR5_CLKDETR_DISABLE_Pos                                        (12UL)   /*!<PWR CR5: CLKDETR_DISABLE (Bit 12) */
#define PWR_CR5_CLKDETR_DISABLE_Msk                                        (0x1000UL)   /*!< PWR CR5: CLKDETR_DISABLE (Bitfield-Mask: 0x01) */
#define PWR_CR5_CLKDETR_DISABLE                                            PWR_CR5_CLKDETR_DISABLE_Msk
#define PWR_CR5_SMPS_ENA_DCM_Pos                                           (11UL)   /*!<PWR CR5: SMPS_ENA_DCM (Bit 11) */
#define PWR_CR5_SMPS_ENA_DCM_Msk                                           (0x800UL)    /*!< PWR CR5: SMPS_ENA_DCM (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPS_ENA_DCM                                               PWR_CR5_SMPS_ENA_DCM_Msk
#define PWR_CR5_NOSMPS_Pos                                                 (10UL)   /*!<PWR CR5: NOSMPS (Bit 10) */
#define PWR_CR5_NOSMPS_Msk                                                 (0x400UL)    /*!< PWR CR5: NOSMPS (Bitfield-Mask: 0x01) */
#define PWR_CR5_NOSMPS                                                     PWR_CR5_NOSMPS_Msk
#define PWR_CR5_SMPSFBYP_Pos                                               (9UL)    /*!<PWR CR5: SMPSFBYP (Bit 9) */
#define PWR_CR5_SMPSFBYP_Msk                                               (0x200UL)    /*!< PWR CR5: SMPSFBYP (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSFBYP                                                   PWR_CR5_SMPSFBYP_Msk
#define PWR_CR5_SMPSLPOPEN_Pos                                             (8UL)    /*!<PWR CR5: SMPSLPOPEN (Bit 8) */
#define PWR_CR5_SMPSLPOPEN_Msk                                             (0x100UL)    /*!< PWR CR5: SMPSLPOPEN (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSLPOPEN                                                 PWR_CR5_SMPSLPOPEN_Msk
#define PWR_CR5_SMPSBOMSEL_Pos                                             (4UL)    /*!<PWR CR5: SMPSBOMSEL (Bit 4) */
#define PWR_CR5_SMPSBOMSEL_Msk                                             (0x30UL)   /*!< PWR CR5: SMPSBOMSEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPSBOMSEL                                                 PWR_CR5_SMPSBOMSEL_Msk
#define PWR_CR5_SMPSBOMSEL_0                                               (0x1U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSBOMSEL_1                                               (0x2U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSLVL_Pos                                                (0UL)    /*!<PWR CR5: SMPSLVL (Bit 0) */
#define PWR_CR5_SMPSLVL_Msk                                                (0xfUL)    /*!< PWR CR5: SMPSLVL (Bitfield-Mask: 0x0f) */
#define PWR_CR5_SMPSLVL                                                    PWR_CR5_SMPSLVL_Msk
#define PWR_CR5_SMPSLVL_0                                                  (0x1U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_1                                                  (0x2U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_2                                                  (0x4U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_3                                                  (0x8U << PWR_CR5_SMPSLVL_Pos)

