embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    SDWN_WUEN    =====================================================*/
#define PWR_SDWN_WUEN_WUEN_Pos                                             (0UL)    /*!<PWR SDWN_WUEN: WUEN (Bit 0) */
#define PWR_SDWN_WUEN_WUEN_Msk                                             (0x1UL)    /*!< PWR SDWN_WUEN: WUEN (Bitfield-Mask: 0x01) */
#define PWR_SDWN_WUEN_WUEN                                                 PWR_SDWN_WUEN_WUEN_Msk

/* =====================================================    SDWN_WUPOL    =====================================================*/
#define PWR_SDWN_WUPOL_WUPOL_Pos                                           (0UL)    /*!<PWR SDWN_WUPOL: WUPOL (Bit 0) */
#define PWR_SDWN_WUPOL_WUPOL_Msk                                           (0x1UL)    /*!< PWR SDWN_WUPOL: WUPOL (Bitfield-Mask: 0x01) */
#define PWR_SDWN_WUPOL_WUPOL                                               PWR_SDWN_WUPOL_WUPOL_Msk

/* =====================================================    SDWN_WUF    =====================================================*/
#define PWR_SDWN_WUF_WUF_Pos                                               (0UL)    /*!<PWR SDWN_WUF: WUF (Bit 0) */
#define PWR_SDWN_WUF_WUF_Msk                                               (0x1UL)    /*!< PWR SDWN_WUF: WUF (Bitfield-Mask: 0x01) */
#define PWR_SDWN_WUF_WUF                                                   PWR_SDWN_WUF_WUF_Msk

/* =====================================================    DBGR    =====================================================*/
#define PWR_DBGR_DEEPSTOP2_Pos                                             (0UL)    /*!<PWR DBGR: DEEPSTOP2 (Bit 0) */
#define PWR_DBGR_DEEPSTOP2_Msk                                             (0x1UL)    /*!< PWR DBGR: DEEPSTOP2 (Bitfield-Mask: 0x01) */
#define PWR_DBGR_DEEPSTOP2                                                 PWR_DBGR_DEEPSTOP2_Msk

/* =====================================================    EXTSRR    =====================================================*/
#define PWR_EXTSRR_RFPHASEF_Pos                                            (10UL)   /*!<PWR EXTSRR: RFPHASEF (Bit 10) */
#define PWR_EXTSRR_RFPHASEF_Msk                                            (0x400UL)    /*!< PWR EXTSRR: RFPHASEF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_RFPHASEF                                                PWR_EXTSRR_RFPHASEF_Msk
#define PWR_EXTSRR_DEEPSTOPF_Pos                                           (9UL)    /*!<PWR EXTSRR: DEEPSTOPF (Bit 9) */
#define PWR_EXTSRR_DEEPSTOPF_Msk                                           (0x200UL)    /*!< PWR EXTSRR: DEEPSTOPF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_DEEPSTOPF                                               PWR_EXTSRR_DEEPSTOPF_Msk

/* =====================================================    TRIMR    =====================================================*/
#define PWR_TRIMR_RAM_SIZE_Pos                                             (12UL)   /*!<PWR TRIMR: RAM_SIZE (Bit 12) */
#define PWR_TRIMR_RAM_SIZE_Msk                                             (0x3000UL)   /*!< PWR TRIMR: RAM_SIZE (Bitfield-Mask: 0x03) */
#define PWR_TRIMR_RAM_SIZE                                                 PWR_TRIMR_RAM_SIZE_Msk
#define PWR_TRIMR_RAM_SIZE_0                                               (0x1U << PWR_TRIMR_RAM_SIZE_Pos)
#define PWR_TRIMR_RAM_SIZE_1                                               (0x2U << PWR_TRIMR_RAM_SIZE_Pos)
#define PWR_TRIMR_SMPS_TRIM_Pos                                            (8UL)    /*!<PWR TRIMR: SMPS_TRIM (Bit 8) */
#define PWR_TRIMR_SMPS_TRIM_Msk                                            (0xf00UL)    /*!< PWR TRIMR: SMPS_TRIM (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_SMPS_TRIM                                                PWR_TRIMR_SMPS_TRIM_Msk
#define PWR_TRIMR_SMPS_TRIM_0                                              (0x1U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_1                                              (0x2U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_2                                              (0x4U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_3                                              (0x8U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_TRIM_MR_Pos                                              (4UL)    /*!<PWR TRIMR: TRIM_MR (Bit 4) */
#define PWR_TRIMR_TRIM_MR_Msk                                              (0xf0UL)   /*!< PWR TRIMR: TRIM_MR (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_TRIM_MR                                                  PWR_TRIMR_TRIM_MR_Msk
#define PWR_TRIMR_TRIM_MR_0                                                (0x1U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_1                                                (0x2U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_2                                                (0x4U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_3                                                (0x8U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_Pos                                         (0UL)    /*!<PWR TRIMR: RFD_REG_TRIM (Bit 0) */
#define PWR_TRIMR_RFD_REG_TRIM_Msk                                         (0xfUL)    /*!< PWR TRIMR: RFD_REG_TRIM (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_RFD_REG_TRIM                                             PWR_TRIMR_RFD_REG_TRIM_Msk
#define PWR_TRIMR_RFD_REG_TRIM_0                                           (0x1U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_1                                           (0x2U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_2                                           (0x4U << PWR_TRIMR_RFD_REG_TRIM_Pos)
#define PWR_TRIMR_RFD_REG_TRIM_3                                           (0x8U << PWR_TRIMR_RFD_REG_TRIM_Pos)

/* =====================================================    ENGTRIM    =====================================================*/
#define PWR_ENGTRIM_SMPS_TRIM_Pos                                          (11UL)   /*!<PWR ENGTRIM: SMPS_TRIM (Bit 11) */
#define PWR_ENGTRIM_SMPS_TRIM_Msk                                          (0x3800UL)   /*!< PWR ENGTRIM: SMPS_TRIM (Bitfield-Mask: 0x07) */
#define PWR_ENGTRIM_SMPS_TRIM                                              PWR_ENGTRIM_SMPS_TRIM_Msk
#define PWR_ENGTRIM_SMPS_TRIM_0                                            (0x1U << PWR_ENGTRIM_SMPS_TRIM_Pos)
#define PWR_ENGTRIM_SMPS_TRIM_1                                            (0x2U << PWR_ENGTRIM_SMPS_TRIM_Pos)
#define PWR_ENGTRIM_SMPS_TRIM_2                                            (0x4U << PWR_ENGTRIM_SMPS_TRIM_Pos)
#define PWR_ENGTRIM_SMPSTRIMEN_Pos                                         (10UL)   /*!<PWR ENGTRIM: SMPSTRIMEN (Bit 10) */
#define PWR_ENGTRIM_SMPSTRIMEN_Msk                                         (0x400UL)    /*!< PWR ENGTRIM: SMPSTRIMEN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM_SMPSTRIMEN                                             PWR_ENGTRIM_SMPSTRIMEN_Msk
#define PWR_ENGTRIM_TRIM_MR_Pos                                            (6UL)    /*!<PWR ENGTRIM: TRIM_MR (Bit 6) */
#define PWR_ENGTRIM_TRIM_MR_Msk                                            (0x3c0UL)    /*!< PWR ENGTRIM: TRIM_MR (Bitfield-Mask: 0x0f) */
#define PWR_ENGTRIM_TRIM_MR                                                PWR_ENGTRIM_TRIM_MR_Msk
#define PWR_ENGTRIM_TRIM_MR_0                                              (0x1U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIM_MR_1                                              (0x2U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIM_MR_2                                              (0x4U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIM_MR_3                                              (0x8U << PWR_ENGTRIM_TRIM_MR_Pos)
#define PWR_ENGTRIM_TRIMMREN_Pos                                           (5UL)    /*!<PWR ENGTRIM: TRIMMREN (Bit 5) */
#define PWR_ENGTRIM_TRIMMREN_Msk                                           (0x20UL)   /*!< PWR ENGTRIM: TRIMMREN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM_TRIMMREN                                               PWR_ENGTRIM_TRIMMREN_Msk
#define PWR_ENGTRIM_RFD_REG_TRIM_Pos                                       (1UL)    /*!<PWR ENGTRIM: RFD_REG_TRIM (Bit 1) */
#define PWR_ENGTRIM_RFD_REG_TRIM_Msk                                       (0x1eUL)   /*!< PWR ENGTRIM: RFD_REG_TRIM (Bitfield-Mask: 0x0f) */
#define PWR_ENGTRIM_RFD_REG_TRIM                                           PWR_ENGTRIM_RFD_REG_TRIM_Msk
#define PWR_ENGTRIM_RFD_REG_TRIM_0                                         (0x1U << PWR_ENGTRIM_RFD_REG_TRIM_Pos)
#define PWR_ENGTRIM_RFD_REG_TRIM_1                                         (0x2U << PWR_ENGTRIM_RFD_REG_TRIM_Pos)
#define PWR_ENGTRIM_RFD_REG_TRIM_2                                         (0x4U << PWR_ENGTRIM_RFD_REG_TRIM_Pos)
#define PWR_ENGTRIM_RFD_REG_TRIM_3                                         (0x8U << PWR_ENGTRIM_RFD_REG_TRIM_Pos)
#define PWR_ENGTRIM_TRIMRFDREGEN_Pos                                       (0UL)    /*!<PWR ENGTRIM: TRIMRFDREGEN (Bit 0) */
#define PWR_ENGTRIM_TRIMRFDREGEN_Msk                                       (0x1UL)    /*!< PWR ENGTRIM: TRIMRFDREGEN (Bitfield-Mask: 0x01) */
#define PWR_ENGTRIM_TRIMRFDREGEN                                           PWR_ENGTRIM_TRIMRFDREGEN_Msk


/* =========================================================================================================================== */
/*=====================                                      SYSCFG                                      ===================== */
/* =========================================================================================================================== */

/* =====================================================    DIE_ID    ===================================================== */
#define SYSCFG_DIE_ID_PRODUCT_Pos                                          (8UL)    /*!<SYSCFG DIE_ID: PRODUCT (Bit 8) */
#define SYSCFG_DIE_ID_PRODUCT_Msk                                          (0xf00UL)    /*!< SYSCFG DIE_ID: PRODUCT (Bitfield-Mask: 0x0f) */
#define SYSCFG_DIE_ID_PRODUCT                                              SYSCFG_DIE_ID_PRODUCT_Msk
#define SYSCFG_DIE_ID_PRODUCT_0                                            (0x1U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_PRODUCT_1                                            (0x2U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_PRODUCT_2                                            (0x4U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_PRODUCT_3                                            (0x8U << SYSCFG_DIE_ID_PRODUCT_Pos)
#define SYSCFG_DIE_ID_VERSION_Pos                                          (4UL)    /*!<SYSCFG DIE_ID: VERSION (Bit 4) */
#define SYSCFG_DIE_ID_VERSION_Msk                                          (0xf0UL)   /*!< SYSCFG DIE_ID: VERSION (Bitfield-Mask: 0x0f) */
#define SYSCFG_DIE_ID_VERSION                                              SYSCFG_DIE_ID_VERSION_Msk
#define SYSCFG_DIE_ID_VERSION_0                                            (0x1U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_VERSION_1                                            (0x2U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_VERSION_2                                            (0x4U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_VERSION_3                                            (0x8U << SYSCFG_DIE_ID_VERSION_Pos)
#define SYSCFG_DIE_ID_REVISION_Pos                                         (0UL)    /*!<SYSCFG DIE_ID: REVISION (Bit 0) */
#define SYSCFG_DIE_ID_REVISION_Msk                                         (0xfUL)    /*!< SYSCFG DIE_ID: REVISION (Bitfield-Mask: 0x0f) */
#define SYSCFG_DIE_ID_REVISION                                             SYSCFG_DIE_ID_REVISION_Msk
#define SYSCFG_DIE_ID_REVISION_0                                           (0x1U << SYSCFG_DIE_ID_REVISION_Pos)
#define SYSCFG_DIE_ID_REVISION_1                                           (0x2U << SYSCFG_DIE_ID_REVISION_Pos)
#define SYSCFG_DIE_ID_REVISION_2                                           (0x4U << SYSCFG_DIE_ID_REVISION_Pos)
#define SYSCFG_DIE_ID_REVISION_3                                           (0x8U << SYSCFG_DIE_ID_REVISION_Pos)

/* =====================================================    JTAG_ID    ===================================================== */
#define SYSCFG_JTAG_ID_VERSION_NUMBER_Pos                                  (28UL)   /*!<SYSCFG JTAG_ID: VERSION_NUMBER (Bit 28) */
#define SYSCFG_JTAG_ID_VERSION_NUMBER_Msk                                  (0xf0000000UL)   /*!< SYSCFG JTAG_ID: VERSION_NUMBER (Bitfield-Mask: 0x0f) */
#define SYSCFG_JTAG_ID_VERSION_NUMBER                                      SYSCFG_JTAG_ID_VERSION_NUMBER_Msk
#define SYSCFG_JTAG_ID_VERSION_NUMBER_0                                    (0x1U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_VERSION_NUMBER_1                                    (0x2U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_VERSION_NUMBER_2                                    (0x4U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_VERSION_NUMBER_3                                    (0x8U << SYSCFG_JTAG_ID_VERSION_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_Pos                                     (12UL)   /*!<SYSCFG JTAG_ID: PART_NUMBER (Bit 12) */
#define SYSCFG_JTAG_ID_PART_NUMBER_Msk                                     (0xffff000UL)    /*!< SYSCFG JTAG_ID: PART_NUMBER (Bitfield-Mask: 0xffff) */
#define SYSCFG_JTAG_ID_PART_NUMBER                                         SYSCFG_JTAG_ID_PART_NUMBER_Msk
#define SYSCFG_JTAG_ID_PART_NUMBER_0                                       (0x1U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_1                                       (0x2U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_2                                       (0x4U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_3                                       (0x8U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_4                                       (0x10U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_5                                       (0x20U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_6                                       (0x40U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_7                                       (0x80U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_8                                       (0x100U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_9                                       (0x200U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_10                                      (0x400U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_11                                      (0x800U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_12                                      (0x1000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_13                                      (0x2000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_14                                      (0x4000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_PART_NUMBER_15                                      (0x8000U << SYSCFG_JTAG_ID_PART_NUMBER_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_Pos                                        (1UL)    /*!<SYSCFG JTAG_ID: MANUF_ID (Bit 1) */
#define SYSCFG_JTAG_ID_MANUF_ID_Msk                                        (0xffeUL)    /*!< SYSCFG JTAG_ID: MANUF_ID (Bitfield-Mask: 0x7ff) */
#define SYSCFG_JTAG_ID_MANUF_ID                                            SYSCFG_JTAG_ID_MANUF_ID_Msk
#define SYSCFG_JTAG_ID_MANUF_ID_0                                          (0x1U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_1                                          (0x2U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_2                                          (0x4U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_3                                          (0x8U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_4                                          (0x10U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_5                                          (0x20U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_6                                          (0x40U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_7                                          (0x80U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_8                                          (0x100U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_9                                          (0x200U << SYSCFG_JTAG_ID_MANUF_ID_Pos)
#define SYSCFG_JTAG_ID_MANUF_ID_10                                         (0x400U << SYSCFG_JTAG_ID_MANUF_ID_Pos)

/* =====================================================    I2C_FMP_CTRL    ===================================================== */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP_Pos                               (3UL)    /*!<SYSCFG I2C_FMP_CTRL: I2C1_PB7_FMP (Bit 3) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP_Msk                               (0x8UL)    /*!< SYSCFG I2C_FMP_CTRL: I2C1_PB7_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP_Pos                               (2UL)    /*!<SYSCFG I2C_FMP_CTRL: I2C1_PB6_FMP (Bit 2) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP_Msk                               (0x4UL)    /*!< SYSCFG I2C_FMP_CTRL: I2C1_PB6_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP_Pos                               (1UL)    /*!<SYSCFG I2C_FMP_CTRL: I2C1_PA1_FMP (Bit 1) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP_Msk                               (0x2UL)    /*!< SYSCFG I2C_FMP_CTRL: I2C1_PA1_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP_Msk
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP_Pos                               (0UL)    /*!<SYSCFG I2C_FMP_CTRL: I2C1_PA0_FMP (Bit 0) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP_Msk                               (0x1UL)    /*!< SYSCFG I2C_FMP_CTRL: I2C1_PA0_FMP (Bitfield-Mask: 0x01) */
#define SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP                                   SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP_Msk

