embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    PWRC_ISCR    ===================================================== */
#define SYSCFG_PWRC_ISCR_WKUP_ISC_Pos                                      (2UL)    /*!<SYSCFG PWRC_ISCR: WKUP_ISC (Bit 2) */
#define SYSCFG_PWRC_ISCR_WKUP_ISC_Msk                                      (0x4UL)    /*!< SYSCFG PWRC_ISCR: WKUP_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_PWRC_ISCR_WKUP_ISC                                          SYSCFG_PWRC_ISCR_WKUP_ISC_Msk
#define SYSCFG_PWRC_ISCR_PVD_ISC_Pos                                       (1UL)    /*!<SYSCFG PWRC_ISCR: PVD_ISC (Bit 1) */
#define SYSCFG_PWRC_ISCR_PVD_ISC_Msk                                       (0x2UL)    /*!< SYSCFG PWRC_ISCR: PVD_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_PWRC_ISCR_PVD_ISC                                           SYSCFG_PWRC_ISCR_PVD_ISC_Msk

/* =====================================================    BLERXTX_DTR    ===================================================== */
#define SYSCFG_BLERXTX_DTR_RX_DT_Pos                                       (1UL)    /*!<SYSCFG BLERXTX_DTR: RX_DT (Bit 1) */
#define SYSCFG_BLERXTX_DTR_RX_DT_Msk                                       (0x2UL)    /*!< SYSCFG BLERXTX_DTR: RX_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_DTR_RX_DT                                           SYSCFG_BLERXTX_DTR_RX_DT_Msk
#define SYSCFG_BLERXTX_DTR_TX_DT_Pos                                       (0UL)    /*!<SYSCFG BLERXTX_DTR: TX_DT (Bit 0) */
#define SYSCFG_BLERXTX_DTR_TX_DT_Msk                                       (0x1UL)    /*!< SYSCFG BLERXTX_DTR: TX_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_DTR_TX_DT                                           SYSCFG_BLERXTX_DTR_TX_DT_Msk

/* =====================================================    BLERXTX_IBER    ===================================================== */
#define SYSCFG_BLERXTX_IBER_RX_IBE_Pos                                     (1UL)    /*!<SYSCFG BLERXTX_IBER: RX_IBE (Bit 1) */
#define SYSCFG_BLERXTX_IBER_RX_IBE_Msk                                     (0x2UL)    /*!< SYSCFG BLERXTX_IBER: RX_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IBER_RX_IBE                                         SYSCFG_BLERXTX_IBER_RX_IBE_Msk
#define SYSCFG_BLERXTX_IBER_TX_IBE_Pos                                     (0UL)    /*!<SYSCFG BLERXTX_IBER: TX_IBE (Bit 0) */
#define SYSCFG_BLERXTX_IBER_TX_IBE_Msk                                     (0x1UL)    /*!< SYSCFG BLERXTX_IBER: TX_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IBER_TX_IBE                                         SYSCFG_BLERXTX_IBER_TX_IBE_Msk

/* =====================================================    BLERXTX_IEVR    ===================================================== */
#define SYSCFG_BLERXTX_IEVR_RX_IEV_Pos                                     (1UL)    /*!<SYSCFG BLERXTX_IEVR: RX_IEV (Bit 1) */
#define SYSCFG_BLERXTX_IEVR_RX_IEV_Msk                                     (0x2UL)    /*!< SYSCFG BLERXTX_IEVR: RX_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IEVR_RX_IEV                                         SYSCFG_BLERXTX_IEVR_RX_IEV_Msk
#define SYSCFG_BLERXTX_IEVR_TX_IEV_Pos                                     (0UL)    /*!<SYSCFG BLERXTX_IEVR: TX_IEV (Bit 0) */
#define SYSCFG_BLERXTX_IEVR_TX_IEV_Msk                                     (0x1UL)    /*!< SYSCFG BLERXTX_IEVR: TX_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IEVR_TX_IEV                                         SYSCFG_BLERXTX_IEVR_TX_IEV_Msk

/* =====================================================    BLERXTX_IER    ===================================================== */
#define SYSCFG_BLERXTX_IER_RX_IE_Pos                                       (1UL)    /*!<SYSCFG BLERXTX_IER: RX_IE (Bit 1) */
#define SYSCFG_BLERXTX_IER_RX_IE_Msk                                       (0x2UL)    /*!< SYSCFG BLERXTX_IER: RX_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IER_RX_IE                                           SYSCFG_BLERXTX_IER_RX_IE_Msk
#define SYSCFG_BLERXTX_IER_TX_IE_Pos                                       (0UL)    /*!<SYSCFG BLERXTX_IER: TX_IE (Bit 0) */
#define SYSCFG_BLERXTX_IER_TX_IE_Msk                                       (0x1UL)    /*!< SYSCFG BLERXTX_IER: TX_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IER_TX_IE                                           SYSCFG_BLERXTX_IER_TX_IE_Msk

/* =====================================================    BLERXTX_ISCR    ===================================================== */
#define SYSCFG_BLERXTX_ISCR_RX_ISEDGE_Pos                                  (3UL)    /*!<SYSCFG BLERXTX_ISCR: RX_ISEDGE (Bit 3) */
#define SYSCFG_BLERXTX_ISCR_RX_ISEDGE_Msk                                  (0x8UL)    /*!< SYSCFG BLERXTX_ISCR: RX_ISEDGE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_ISCR_RX_ISEDGE                                      SYSCFG_BLERXTX_ISCR_RX_ISEDGE_Msk
#define SYSCFG_BLERXTX_ISCR_TX_ISEDGE_Pos                                  (2UL)    /*!<SYSCFG BLERXTX_ISCR: TX_ISEDGE (Bit 2) */
#define SYSCFG_BLERXTX_ISCR_TX_ISEDGE_Msk                                  (0x4UL)    /*!< SYSCFG BLERXTX_ISCR: TX_ISEDGE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_ISCR_TX_ISEDGE                                      SYSCFG_BLERXTX_ISCR_TX_ISEDGE_Msk
#define SYSCFG_BLERXTX_ISCR_RX_ISC_Pos                                     (1UL)    /*!<SYSCFG BLERXTX_ISCR: RX_ISC (Bit 1) */
#define SYSCFG_BLERXTX_ISCR_RX_ISC_Msk                                     (0x2UL)    /*!< SYSCFG BLERXTX_ISCR: RX_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_ISCR_RX_ISC                                         SYSCFG_BLERXTX_ISCR_RX_ISC_Msk
#define SYSCFG_BLERXTX_ISCR_TX_ISC_Pos                                     (0UL)    /*!<SYSCFG BLERXTX_ISCR: TX_ISC (Bit 0) */
#define SYSCFG_BLERXTX_ISCR_TX_ISC_Msk                                     (0x1UL)    /*!< SYSCFG BLERXTX_ISCR: TX_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_ISCR_TX_ISC                                         SYSCFG_BLERXTX_ISCR_TX_ISC_Msk


