embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    POSTP_CR    =====================================================*/
#define RNG_POSTP_CR_NB_RND_REINIT_Pos                                     (16UL)   /*!<RNG POSTP_CR: NB_RND_REINIT (Bit 16) */
#define RNG_POSTP_CR_NB_RND_REINIT_Msk                                     (0xffff0000UL)   /*!< RNG POSTP_CR: NB_RND_REINIT (Bitfield-Mask: 0xffff) */
#define RNG_POSTP_CR_NB_RND_REINIT                                         RNG_POSTP_CR_NB_RND_REINIT_Msk
#define RNG_POSTP_CR_NB_RND_REINIT_0                                       (0x1U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_1                                       (0x2U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_2                                       (0x4U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_3                                       (0x8U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_4                                       (0x10U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_5                                       (0x20U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_6                                       (0x40U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_7                                       (0x80U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_8                                       (0x100U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_9                                       (0x200U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_10                                      (0x400U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_11                                      (0x800U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_12                                      (0x1000U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_13                                      (0x2000U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_14                                      (0x4000U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_RND_REINIT_15                                      (0x8000U << RNG_POSTP_CR_NB_RND_REINIT_Pos)
#define RNG_POSTP_CR_NB_LOOP_AES_Pos                                       (8UL)    /*!<RNG POSTP_CR: NB_LOOP_AES (Bit 8) */
#define RNG_POSTP_CR_NB_LOOP_AES_Msk                                       (0xf00UL)    /*!< RNG POSTP_CR: NB_LOOP_AES (Bitfield-Mask: 0x0f) */
#define RNG_POSTP_CR_NB_LOOP_AES                                           RNG_POSTP_CR_NB_LOOP_AES_Msk
#define RNG_POSTP_CR_NB_LOOP_AES_0                                         (0x1U << RNG_POSTP_CR_NB_LOOP_AES_Pos)
#define RNG_POSTP_CR_NB_LOOP_AES_1                                         (0x2U << RNG_POSTP_CR_NB_LOOP_AES_Pos)
#define RNG_POSTP_CR_NB_LOOP_AES_2                                         (0x4U << RNG_POSTP_CR_NB_LOOP_AES_Pos)
#define RNG_POSTP_CR_NB_LOOP_AES_3                                         (0x8U << RNG_POSTP_CR_NB_LOOP_AES_Pos)
#define RNG_POSTP_CR_AES_RESET_Pos                                         (0UL)    /*!<RNG POSTP_CR: AES_RESET (Bit 0) */
#define RNG_POSTP_CR_AES_RESET_Msk                                         (0x1UL)    /*!< RNG POSTP_CR: AES_RESET (Bitfield-Mask: 0x01) */
#define RNG_POSTP_CR_AES_RESET                                             RNG_POSTP_CR_AES_RESET_Msk

/* =====================================================    POSTP_SR    =====================================================*/
#define RNG_POSTP_SR_AES_DOUT_ERROR_Pos                                    (6UL)    /*!<RNG POSTP_SR: AES_DOUT_ERROR (Bit 6) */
#define RNG_POSTP_SR_AES_DOUT_ERROR_Msk                                    (0x40UL)   /*!< RNG POSTP_SR: AES_DOUT_ERROR (Bitfield-Mask: 0x01) */
#define RNG_POSTP_SR_AES_DOUT_ERROR                                        RNG_POSTP_SR_AES_DOUT_ERROR_Msk
#define RNG_POSTP_SR_AES_K12_ERROR_Pos                                     (5UL)    /*!<RNG POSTP_SR: AES_K12_ERROR (Bit 5) */
#define RNG_POSTP_SR_AES_K12_ERROR_Msk                                     (0x20UL)   /*!< RNG POSTP_SR: AES_K12_ERROR (Bitfield-Mask: 0x01) */
#define RNG_POSTP_SR_AES_K12_ERROR                                         RNG_POSTP_SR_AES_K12_ERROR_Msk
#define RNG_POSTP_SR_AES_HEALTH_DONE_Pos                                   (4UL)    /*!<RNG POSTP_SR: AES_HEALTH_DONE (Bit 4) */
#define RNG_POSTP_SR_AES_HEALTH_DONE_Msk                                   (0x10UL)   /*!< RNG POSTP_SR: AES_HEALTH_DONE (Bitfield-Mask: 0x01) */
#define RNG_POSTP_SR_AES_HEALTH_DONE                                       RNG_POSTP_SR_AES_HEALTH_DONE_Msk
#define RNG_POSTP_SR_AES_BUSY_Pos                                          (3UL)    /*!<RNG POSTP_SR: AES_BUSY (Bit 3) */
#define RNG_POSTP_SR_AES_BUSY_Msk                                          (0x8UL)    /*!< RNG POSTP_SR: AES_BUSY (Bitfield-Mask: 0x01) */
#define RNG_POSTP_SR_AES_BUSY                                              RNG_POSTP_SR_AES_BUSY_Msk
#define RNG_POSTP_SR_AES_KEY_LD_Pos                                        (2UL)    /*!<RNG POSTP_SR: AES_KEY_LD (Bit 2) */
#define RNG_POSTP_SR_AES_KEY_LD_Msk                                        (0x4UL)    /*!< RNG POSTP_SR: AES_KEY_LD (Bitfield-Mask: 0x01) */
#define RNG_POSTP_SR_AES_KEY_LD                                            RNG_POSTP_SR_AES_KEY_LD_Msk
#define RNG_POSTP_SR_AES_INIT_Pos                                          (1UL)    /*!<RNG POSTP_SR: AES_INIT (Bit 1) */
#define RNG_POSTP_SR_AES_INIT_Msk                                          (0x2UL)    /*!< RNG POSTP_SR: AES_INIT (Bitfield-Mask: 0x01) */
#define RNG_POSTP_SR_AES_INIT                                              RNG_POSTP_SR_AES_INIT_Msk

/* =====================================================    DEFKEY0    =====================================================*/
#define RNG_DEFKEY0_RNG_DEFKEY0_Pos                                        (0UL)    /*!<RNG DEFKEY0: RNG_DEFKEY0 (Bit 0) */
#define RNG_DEFKEY0_RNG_DEFKEY0_Msk                                        (0xffffffffUL)   /*!< RNG DEFKEY0: RNG_DEFKEY0 (Bitfield-Mask: 0xffffffff) */
#define RNG_DEFKEY0_RNG_DEFKEY0                                            RNG_DEFKEY0_RNG_DEFKEY0_Msk
#define RNG_DEFKEY0_RNG_DEFKEY0_0                                          (0x1U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_1                                          (0x2U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_2                                          (0x4U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_3                                          (0x8U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_4                                          (0x10U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_5                                          (0x20U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_6                                          (0x40U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_7                                          (0x80U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_8                                          (0x100U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_9                                          (0x200U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_10                                         (0x400U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_11                                         (0x800U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_12                                         (0x1000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_13                                         (0x2000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_14                                         (0x4000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_15                                         (0x8000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_16                                         (0x10000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_17                                         (0x20000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_18                                         (0x40000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_19                                         (0x80000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_20                                         (0x100000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_21                                         (0x200000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_22                                         (0x400000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_23                                         (0x800000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_24                                         (0x1000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_25                                         (0x2000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_26                                         (0x4000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_27                                         (0x8000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_28                                         (0x10000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_29                                         (0x20000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_30                                         (0x40000000U << RNG_DEFKEY0_RNG_DEFKEY0_Pos)
#define RNG_DEFKEY0_RNG_DEFKEY0_31                                         (0x80000000UL << RNG_DEFKEY0_RNG_DEFKEY0_Pos)

/* =====================================================    DEFKEY1    =====================================================*/
#define RNG_DEFKEY1_RNG_DEFKEY1_Pos                                        (0UL)    /*!<RNG DEFKEY1: RNG_DEFKEY1 (Bit 0) */
#define RNG_DEFKEY1_RNG_DEFKEY1_Msk                                        (0xffffffffUL)   /*!< RNG DEFKEY1: RNG_DEFKEY1 (Bitfield-Mask: 0xffffffff) */
#define RNG_DEFKEY1_RNG_DEFKEY1                                            RNG_DEFKEY1_RNG_DEFKEY1_Msk
#define RNG_DEFKEY1_RNG_DEFKEY1_0                                          (0x1U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_1                                          (0x2U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_2                                          (0x4U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_3                                          (0x8U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_4                                          (0x10U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_5                                          (0x20U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_6                                          (0x40U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_7                                          (0x80U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_8                                          (0x100U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_9                                          (0x200U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_10                                         (0x400U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_11                                         (0x800U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_12                                         (0x1000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_13                                         (0x2000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_14                                         (0x4000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_15                                         (0x8000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_16                                         (0x10000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_17                                         (0x20000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_18                                         (0x40000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_19                                         (0x80000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_20                                         (0x100000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_21                                         (0x200000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_22                                         (0x400000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_23                                         (0x800000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_24                                         (0x1000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_25                                         (0x2000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_26                                         (0x4000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_27                                         (0x8000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_28                                         (0x10000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_29                                         (0x20000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_30                                         (0x40000000U << RNG_DEFKEY1_RNG_DEFKEY1_Pos)
#define RNG_DEFKEY1_RNG_DEFKEY1_31                                         (0x80000000UL << RNG_DEFKEY1_RNG_DEFKEY1_Pos)

/* =====================================================    DEFKEY2    =====================================================*/
#define RNG_DEFKEY2_RNG_DEFKEY2_Pos                                        (0UL)    /*!<RNG DEFKEY2: RNG_DEFKEY2 (Bit 0) */
#define RNG_DEFKEY2_RNG_DEFKEY2_Msk                                        (0xffffffffUL)   /*!< RNG DEFKEY2: RNG_DEFKEY2 (Bitfield-Mask: 0xffffffff) */
#define RNG_DEFKEY2_RNG_DEFKEY2                                            RNG_DEFKEY2_RNG_DEFKEY2_Msk
#define RNG_DEFKEY2_RNG_DEFKEY2_0                                          (0x1U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_1                                          (0x2U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_2                                          (0x4U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_3                                          (0x8U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_4                                          (0x10U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_5                                          (0x20U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_6                                          (0x40U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_7                                          (0x80U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_8                                          (0x100U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_9                                          (0x200U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_10                                         (0x400U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_11                                         (0x800U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_12                                         (0x1000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_13                                         (0x2000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_14                                         (0x4000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_15                                         (0x8000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_16                                         (0x10000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_17                                         (0x20000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_18                                         (0x40000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_19                                         (0x80000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_20                                         (0x100000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_21                                         (0x200000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_22                                         (0x400000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_23                                         (0x800000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_24                                         (0x1000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_25                                         (0x2000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_26                                         (0x4000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_27                                         (0x8000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_28                                         (0x10000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_29                                         (0x20000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_30                                         (0x40000000U << RNG_DEFKEY2_RNG_DEFKEY2_Pos)
#define RNG_DEFKEY2_RNG_DEFKEY2_31                                         (0x80000000UL << RNG_DEFKEY2_RNG_DEFKEY2_Pos)

