embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    DR    ===================================================== */
#define RTC_DR_YT_Pos                                                      (20UL)   /*!<RTC DR: YT (Bit 20) */
#define RTC_DR_YT_Msk                                                      (0xf00000UL)   /*!< RTC DR: YT (Bitfield-Mask: 0x0f) */
#define RTC_DR_YT                                                          RTC_DR_YT_Msk
#define RTC_DR_YT_0                                                        (0x1U << RTC_DR_YT_Pos)
#define RTC_DR_YT_1                                                        (0x2U << RTC_DR_YT_Pos)
#define RTC_DR_YT_2                                                        (0x4U << RTC_DR_YT_Pos)
#define RTC_DR_YT_3                                                        (0x8U << RTC_DR_YT_Pos)
#define RTC_DR_YU_Pos                                                      (16UL)   /*!<RTC DR: YU (Bit 16) */
#define RTC_DR_YU_Msk                                                      (0xf0000UL)    /*!< RTC DR: YU (Bitfield-Mask: 0x0f) */
#define RTC_DR_YU                                                          RTC_DR_YU_Msk
#define RTC_DR_YU_0                                                        (0x1U << RTC_DR_YU_Pos)
#define RTC_DR_YU_1                                                        (0x2U << RTC_DR_YU_Pos)
#define RTC_DR_YU_2                                                        (0x4U << RTC_DR_YU_Pos)
#define RTC_DR_YU_3                                                        (0x8U << RTC_DR_YU_Pos)
#define RTC_DR_WDU_Pos                                                     (13UL)   /*!<RTC DR: WDU (Bit 13) */
#define RTC_DR_WDU_Msk                                                     (0xe000UL)   /*!< RTC DR: WDU (Bitfield-Mask: 0x07) */
#define RTC_DR_WDU                                                         RTC_DR_WDU_Msk
#define RTC_DR_WDU_0                                                       (0x1U << RTC_DR_WDU_Pos)
#define RTC_DR_WDU_1                                                       (0x2U << RTC_DR_WDU_Pos)
#define RTC_DR_WDU_2                                                       (0x4U << RTC_DR_WDU_Pos)
#define RTC_DR_MT_Pos                                                      (12UL)   /*!<RTC DR: MT (Bit 12) */
#define RTC_DR_MT_Msk                                                      (0x1000UL)   /*!< RTC DR: MT (Bitfield-Mask: 0x01) */
#define RTC_DR_MT                                                          RTC_DR_MT_Msk
#define RTC_DR_MU_Pos                                                      (8UL)    /*!<RTC DR: MU (Bit 8) */
#define RTC_DR_MU_Msk                                                      (0xf00UL)    /*!< RTC DR: MU (Bitfield-Mask: 0x0f) */
#define RTC_DR_MU                                                          RTC_DR_MU_Msk
#define RTC_DR_MU_0                                                        (0x1U << RTC_DR_MU_Pos)
#define RTC_DR_MU_1                                                        (0x2U << RTC_DR_MU_Pos)
#define RTC_DR_MU_2                                                        (0x4U << RTC_DR_MU_Pos)
#define RTC_DR_MU_3                                                        (0x8U << RTC_DR_MU_Pos)
#define RTC_DR_DT_Pos                                                      (4UL)    /*!<RTC DR: DT (Bit 4) */
#define RTC_DR_DT_Msk                                                      (0x30UL)   /*!< RTC DR: DT (Bitfield-Mask: 0x03) */
#define RTC_DR_DT                                                          RTC_DR_DT_Msk
#define RTC_DR_DT_0                                                        (0x1U << RTC_DR_DT_Pos)
#define RTC_DR_DT_1                                                        (0x2U << RTC_DR_DT_Pos)
#define RTC_DR_DU_Pos                                                      (0UL)    /*!<RTC DR: DU (Bit 0) */
#define RTC_DR_DU_Msk                                                      (0xfUL)    /*!< RTC DR: DU (Bitfield-Mask: 0x0f) */
#define RTC_DR_DU                                                          RTC_DR_DU_Msk
#define RTC_DR_DU_0                                                        (0x1U << RTC_DR_DU_Pos)
#define RTC_DR_DU_1                                                        (0x2U << RTC_DR_DU_Pos)
#define RTC_DR_DU_2                                                        (0x4U << RTC_DR_DU_Pos)
#define RTC_DR_DU_3                                                        (0x8U << RTC_DR_DU_Pos)

/* =====================================================    CR    ===================================================== */
#define RTC_CR_COE_Pos                                                     (23UL)   /*!<RTC CR: COE (Bit 23) */
#define RTC_CR_COE_Msk                                                     (0x800000UL)   /*!< RTC CR: COE (Bitfield-Mask: 0x01) */
#define RTC_CR_COE                                                         RTC_CR_COE_Msk
#define RTC_CR_OSEL_Pos                                                    (21UL)   /*!<RTC CR: OSEL (Bit 21) */
#define RTC_CR_OSEL_Msk                                                    (0x600000UL)   /*!< RTC CR: OSEL (Bitfield-Mask: 0x03) */
#define RTC_CR_OSEL                                                        RTC_CR_OSEL_Msk
#define RTC_CR_OSEL_0                                                      (0x1U << RTC_CR_OSEL_Pos)
#define RTC_CR_OSEL_1                                                      (0x2U << RTC_CR_OSEL_Pos)
#define RTC_CR_POL_Pos                                                     (20UL)   /*!<RTC CR: POL (Bit 20) */
#define RTC_CR_POL_Msk                                                     (0x100000UL)   /*!< RTC CR: POL (Bitfield-Mask: 0x01) */
#define RTC_CR_POL                                                         RTC_CR_POL_Msk
#define RTC_CR_COSEL_Pos                                                   (19UL)   /*!<RTC CR: COSEL (Bit 19) */
#define RTC_CR_COSEL_Msk                                                   (0x80000UL)    /*!< RTC CR: COSEL (Bitfield-Mask: 0x01) */
#define RTC_CR_COSEL                                                       RTC_CR_COSEL_Msk
#define RTC_CR_BKP_Pos                                                     (18UL)   /*!<RTC CR: BKP (Bit 18) */
#define RTC_CR_BKP_Msk                                                     (0x40000UL)    /*!< RTC CR: BKP (Bitfield-Mask: 0x01) */
#define RTC_CR_BKP                                                         RTC_CR_BKP_Msk
#define RTC_CR_SUB1H_Pos                                                   (17UL)   /*!<RTC CR: SUB1H (Bit 17) */
#define RTC_CR_SUB1H_Msk                                                   (0x20000UL)    /*!< RTC CR: SUB1H (Bitfield-Mask: 0x01) */
#define RTC_CR_SUB1H                                                       RTC_CR_SUB1H_Msk
#define RTC_CR_ADD1H_Pos                                                   (16UL)   /*!<RTC CR: ADD1H (Bit 16) */
#define RTC_CR_ADD1H_Msk                                                   (0x10000UL)    /*!< RTC CR: ADD1H (Bitfield-Mask: 0x01) */
#define RTC_CR_ADD1H                                                       RTC_CR_ADD1H_Msk
#define RTC_CR_WUTIE_Pos                                                   (14UL)   /*!<RTC CR: WUTIE (Bit 14) */
#define RTC_CR_WUTIE_Msk                                                   (0x4000UL)   /*!< RTC CR: WUTIE (Bitfield-Mask: 0x01) */
#define RTC_CR_WUTIE                                                       RTC_CR_WUTIE_Msk
#define RTC_CR_ALRAIE_Pos                                                  (12UL)   /*!<RTC CR: ALRAIE (Bit 12) */
#define RTC_CR_ALRAIE_Msk                                                  (0x1000UL)   /*!< RTC CR: ALRAIE (Bitfield-Mask: 0x01) */
#define RTC_CR_ALRAIE                                                      RTC_CR_ALRAIE_Msk
#define RTC_CR_WUTE_Pos                                                    (10UL)   /*!<RTC CR: WUTE (Bit 10) */
#define RTC_CR_WUTE_Msk                                                    (0x400UL)    /*!< RTC CR: WUTE (Bitfield-Mask: 0x01) */
#define RTC_CR_WUTE                                                        RTC_CR_WUTE_Msk
#define RTC_CR_ALRAE_Pos                                                   (8UL)    /*!<RTC CR: ALRAE (Bit 8) */
#define RTC_CR_ALRAE_Msk                                                   (0x100UL)    /*!< RTC CR: ALRAE (Bitfield-Mask: 0x01) */
#define RTC_CR_ALRAE                                                       RTC_CR_ALRAE_Msk
#define RTC_CR_FMT_Pos                                                     (6UL)    /*!<RTC CR: FMT (Bit 6) */
#define RTC_CR_FMT_Msk                                                     (0x40UL)   /*!< RTC CR: FMT (Bitfield-Mask: 0x01) */
#define RTC_CR_FMT                                                         RTC_CR_FMT_Msk
#define RTC_CR_BYPSHAD_Pos                                                 (5UL)    /*!<RTC CR: BYPSHAD (Bit 5) */
#define RTC_CR_BYPSHAD_Msk                                                 (0x20UL)   /*!< RTC CR: BYPSHAD (Bitfield-Mask: 0x01) */
#define RTC_CR_BYPSHAD                                                     RTC_CR_BYPSHAD_Msk
#define RTC_CR_WUCKSEL_Pos                                                 (0UL)    /*!<RTC CR: WUCKSEL (Bit 0) */
#define RTC_CR_WUCKSEL_Msk                                                 (0x7UL)    /*!< RTC CR: WUCKSEL (Bitfield-Mask: 0x07) */
#define RTC_CR_WUCKSEL                                                     RTC_CR_WUCKSEL_Msk
#define RTC_CR_WUCKSEL_0                                                   (0x1U << RTC_CR_WUCKSEL_Pos)
#define RTC_CR_WUCKSEL_1                                                   (0x2U << RTC_CR_WUCKSEL_Pos)
#define RTC_CR_WUCKSEL_2                                                   (0x4U << RTC_CR_WUCKSEL_Pos)

/* =====================================================    ISR    ===================================================== */
#define RTC_ISR_RECALPF_Pos                                                (16UL)   /*!<RTC ISR: RECALPF (Bit 16) */
#define RTC_ISR_RECALPF_Msk                                                (0x10000UL)    /*!< RTC ISR: RECALPF (Bitfield-Mask: 0x01) */
#define RTC_ISR_RECALPF                                                    RTC_ISR_RECALPF_Msk
#define RTC_ISR_WUTF_Pos                                                   (10UL)   /*!<RTC ISR: WUTF (Bit 10) */
#define RTC_ISR_WUTF_Msk                                                   (0x400UL)    /*!< RTC ISR: WUTF (Bitfield-Mask: 0x01) */
#define RTC_ISR_WUTF                                                       RTC_ISR_WUTF_Msk
#define RTC_ISR_ALRAF_Pos                                                  (8UL)    /*!<RTC ISR: ALRAF (Bit 8) */
#define RTC_ISR_ALRAF_Msk                                                  (0x100UL)    /*!< RTC ISR: ALRAF (Bitfield-Mask: 0x01) */
#define RTC_ISR_ALRAF                                                      RTC_ISR_ALRAF_Msk
#define RTC_ISR_INIT_Pos                                                   (7UL)    /*!<RTC ISR: INIT (Bit 7) */
#define RTC_ISR_INIT_Msk                                                   (0x80UL)   /*!< RTC ISR: INIT (Bitfield-Mask: 0x01) */
#define RTC_ISR_INIT                                                       RTC_ISR_INIT_Msk
#define RTC_ISR_INITF_Pos                                                  (6UL)    /*!<RTC ISR: INITF (Bit 6) */
#define RTC_ISR_INITF_Msk                                                  (0x40UL)   /*!< RTC ISR: INITF (Bitfield-Mask: 0x01) */
#define RTC_ISR_INITF                                                      RTC_ISR_INITF_Msk
#define RTC_ISR_RSF_Pos                                                    (5UL)    /*!<RTC ISR: RSF (Bit 5) */
#define RTC_ISR_RSF_Msk                                                    (0x20UL)   /*!< RTC ISR: RSF (Bitfield-Mask: 0x01) */
#define RTC_ISR_RSF                                                        RTC_ISR_RSF_Msk
#define RTC_ISR_INITS_Pos                                                  (4UL)    /*!<RTC ISR: INITS (Bit 4) */
#define RTC_ISR_INITS_Msk                                                  (0x10UL)   /*!< RTC ISR: INITS (Bitfield-Mask: 0x01) */
#define RTC_ISR_INITS                                                      RTC_ISR_INITS_Msk
#define RTC_ISR_SHPF_Pos                                                   (3UL)    /*!<RTC ISR: SHPF (Bit 3) */
#define RTC_ISR_SHPF_Msk                                                   (0x8UL)    /*!< RTC ISR: SHPF (Bitfield-Mask: 0x01) */
#define RTC_ISR_SHPF                                                       RTC_ISR_SHPF_Msk
#define RTC_ISR_WUTWF_Pos                                                  (2UL)    /*!<RTC ISR: WUTWF (Bit 2) */
#define RTC_ISR_WUTWF_Msk                                                  (0x4UL)    /*!< RTC ISR: WUTWF (Bitfield-Mask: 0x01) */
#define RTC_ISR_WUTWF                                                      RTC_ISR_WUTWF_Msk
#define RTC_ISR_ALRAWF_Pos                                                 (0UL)    /*!<RTC ISR: ALRAWF (Bit 0) */
#define RTC_ISR_ALRAWF_Msk                                                 (0x1UL)    /*!< RTC ISR: ALRAWF (Bitfield-Mask: 0x01) */
#define RTC_ISR_ALRAWF                                                     RTC_ISR_ALRAWF_Msk

/* =====================================================    PRER    ===================================================== */
#define RTC_PRER_PREDIV_A_Pos                                              (16UL)   /*!<RTC PRER: PREDIV_A (Bit 16) */
#define RTC_PRER_PREDIV_A_Msk                                              (0x7f0000UL)   /*!< RTC PRER: PREDIV_A (Bitfield-Mask: 0x7f) */
#define RTC_PRER_PREDIV_A                                                  RTC_PRER_PREDIV_A_Msk
#define RTC_PRER_PREDIV_A_0                                                (0x1U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_1                                                (0x2U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_2                                                (0x4U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_3                                                (0x8U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_4                                                (0x10U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_5                                                (0x20U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_A_6                                                (0x40U << RTC_PRER_PREDIV_A_Pos)
#define RTC_PRER_PREDIV_S_Pos                                              (0UL)    /*!<RTC PRER: PREDIV_S (Bit 0) */
#define RTC_PRER_PREDIV_S_Msk                                              (0x7fffUL)   /*!< RTC PRER: PREDIV_S (Bitfield-Mask: 0x7fff) */
#define RTC_PRER_PREDIV_S                                                  RTC_PRER_PREDIV_S_Msk
#define RTC_PRER_PREDIV_S_0                                                (0x1U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_1                                                (0x2U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_2                                                (0x4U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_3                                                (0x8U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_4                                                (0x10U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_5                                                (0x20U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_6                                                (0x40U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_7                                                (0x80U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_8                                                (0x100U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_9                                                (0x200U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_10                                               (0x400U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_11                                               (0x800U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_12                                               (0x1000U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_13                                               (0x2000U << RTC_PRER_PREDIV_S_Pos)
#define RTC_PRER_PREDIV_S_14                                               (0x4000U << RTC_PRER_PREDIV_S_Pos)

