embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    WUTR    ===================================================== */
#define RTC_WUTR_WUT_Pos                                                   (0UL)    /*!<RTC WUTR: WUT (Bit 0) */
#define RTC_WUTR_WUT_Msk                                                   (0xffffUL)   /*!< RTC WUTR: WUT (Bitfield-Mask: 0xffff) */
#define RTC_WUTR_WUT                                                       RTC_WUTR_WUT_Msk
#define RTC_WUTR_WUT_0                                                     (0x1U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_1                                                     (0x2U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_2                                                     (0x4U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_3                                                     (0x8U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_4                                                     (0x10U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_5                                                     (0x20U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_6                                                     (0x40U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_7                                                     (0x80U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_8                                                     (0x100U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_9                                                     (0x200U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_10                                                    (0x400U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_11                                                    (0x800U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_12                                                    (0x1000U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_13                                                    (0x2000U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_14                                                    (0x4000U << RTC_WUTR_WUT_Pos)
#define RTC_WUTR_WUT_15                                                    (0x8000U << RTC_WUTR_WUT_Pos)

/* =====================================================    ALRMAR    ===================================================== */
#define RTC_ALRMAR_MSK4_Pos                                                (31UL)   /*!<RTC ALRMAR: MSK4 (Bit 31) */
#define RTC_ALRMAR_MSK4_Msk                                                (0x80000000UL)   /*!< RTC ALRMAR: MSK4 (Bitfield-Mask: 0x01) */
#define RTC_ALRMAR_MSK4                                                    RTC_ALRMAR_MSK4_Msk
#define RTC_ALRMAR_WDSEL_Pos                                               (30UL)   /*!<RTC ALRMAR: WDSEL (Bit 30) */
#define RTC_ALRMAR_WDSEL_Msk                                               (0x40000000UL)   /*!< RTC ALRMAR: WDSEL (Bitfield-Mask: 0x01) */
#define RTC_ALRMAR_WDSEL                                                   RTC_ALRMAR_WDSEL_Msk
#define RTC_ALRMAR_DT_Pos                                                  (28UL)   /*!<RTC ALRMAR: DT (Bit 28) */
#define RTC_ALRMAR_DT_Msk                                                  (0x30000000UL)   /*!< RTC ALRMAR: DT (Bitfield-Mask: 0x03) */
#define RTC_ALRMAR_DT                                                      RTC_ALRMAR_DT_Msk
#define RTC_ALRMAR_DT_0                                                    (0x1U << RTC_ALRMAR_DT_Pos)
#define RTC_ALRMAR_DT_1                                                    (0x2U << RTC_ALRMAR_DT_Pos)
#define RTC_ALRMAR_DU_Pos                                                  (24UL)   /*!<RTC ALRMAR: DU (Bit 24) */
#define RTC_ALRMAR_DU_Msk                                                  (0xf000000UL)    /*!< RTC ALRMAR: DU (Bitfield-Mask: 0x0f) */
#define RTC_ALRMAR_DU                                                      RTC_ALRMAR_DU_Msk
#define RTC_ALRMAR_DU_0                                                    (0x1U << RTC_ALRMAR_DU_Pos)
#define RTC_ALRMAR_DU_1                                                    (0x2U << RTC_ALRMAR_DU_Pos)
#define RTC_ALRMAR_DU_2                                                    (0x4U << RTC_ALRMAR_DU_Pos)
#define RTC_ALRMAR_DU_3                                                    (0x8U << RTC_ALRMAR_DU_Pos)
#define RTC_ALRMAR_MSK3_Pos                                                (23UL)   /*!<RTC ALRMAR: MSK3 (Bit 23) */
#define RTC_ALRMAR_MSK3_Msk                                                (0x800000UL)   /*!< RTC ALRMAR: MSK3 (Bitfield-Mask: 0x01) */
#define RTC_ALRMAR_MSK3                                                    RTC_ALRMAR_MSK3_Msk
#define RTC_ALRMAR_PM_Pos                                                  (22UL)   /*!<RTC ALRMAR: PM (Bit 22) */
#define RTC_ALRMAR_PM_Msk                                                  (0x400000UL)   /*!< RTC ALRMAR: PM (Bitfield-Mask: 0x01) */
#define RTC_ALRMAR_PM                                                      RTC_ALRMAR_PM_Msk
#define RTC_ALRMAR_HT_Pos                                                  (20UL)   /*!<RTC ALRMAR: HT (Bit 20) */
#define RTC_ALRMAR_HT_Msk                                                  (0x300000UL)   /*!< RTC ALRMAR: HT (Bitfield-Mask: 0x03) */
#define RTC_ALRMAR_HT                                                      RTC_ALRMAR_HT_Msk
#define RTC_ALRMAR_HT_0                                                    (0x1U << RTC_ALRMAR_HT_Pos)
#define RTC_ALRMAR_HT_1                                                    (0x2U << RTC_ALRMAR_HT_Pos)
#define RTC_ALRMAR_HU_Pos                                                  (16UL)   /*!<RTC ALRMAR: HU (Bit 16) */
#define RTC_ALRMAR_HU_Msk                                                  (0xf0000UL)    /*!< RTC ALRMAR: HU (Bitfield-Mask: 0x0f) */
#define RTC_ALRMAR_HU                                                      RTC_ALRMAR_HU_Msk
#define RTC_ALRMAR_HU_0                                                    (0x1U << RTC_ALRMAR_HU_Pos)
#define RTC_ALRMAR_HU_1                                                    (0x2U << RTC_ALRMAR_HU_Pos)
#define RTC_ALRMAR_HU_2                                                    (0x4U << RTC_ALRMAR_HU_Pos)
#define RTC_ALRMAR_HU_3                                                    (0x8U << RTC_ALRMAR_HU_Pos)
#define RTC_ALRMAR_MSK2_Pos                                                (15UL)   /*!<RTC ALRMAR: MSK2 (Bit 15) */
#define RTC_ALRMAR_MSK2_Msk                                                (0x8000UL)   /*!< RTC ALRMAR: MSK2 (Bitfield-Mask: 0x01) */
#define RTC_ALRMAR_MSK2                                                    RTC_ALRMAR_MSK2_Msk
#define RTC_ALRMAR_MNT_Pos                                                 (12UL)   /*!<RTC ALRMAR: MNT (Bit 12) */
#define RTC_ALRMAR_MNT_Msk                                                 (0x7000UL)   /*!< RTC ALRMAR: MNT (Bitfield-Mask: 0x07) */
#define RTC_ALRMAR_MNT                                                     RTC_ALRMAR_MNT_Msk
#define RTC_ALRMAR_MNT_0                                                   (0x1U << RTC_ALRMAR_MNT_Pos)
#define RTC_ALRMAR_MNT_1                                                   (0x2U << RTC_ALRMAR_MNT_Pos)
#define RTC_ALRMAR_MNT_2                                                   (0x4U << RTC_ALRMAR_MNT_Pos)
#define RTC_ALRMAR_MNU_Pos                                                 (8UL)    /*!<RTC ALRMAR: MNU (Bit 8) */
#define RTC_ALRMAR_MNU_Msk                                                 (0xf00UL)    /*!< RTC ALRMAR: MNU (Bitfield-Mask: 0x0f) */
#define RTC_ALRMAR_MNU                                                     RTC_ALRMAR_MNU_Msk
#define RTC_ALRMAR_MNU_0                                                   (0x1U << RTC_ALRMAR_MNU_Pos)
#define RTC_ALRMAR_MNU_1                                                   (0x2U << RTC_ALRMAR_MNU_Pos)
#define RTC_ALRMAR_MNU_2                                                   (0x4U << RTC_ALRMAR_MNU_Pos)
#define RTC_ALRMAR_MNU_3                                                   (0x8U << RTC_ALRMAR_MNU_Pos)
#define RTC_ALRMAR_MSK1_Pos                                                (7UL)    /*!<RTC ALRMAR: MSK1 (Bit 7) */
#define RTC_ALRMAR_MSK1_Msk                                                (0x80UL)   /*!< RTC ALRMAR: MSK1 (Bitfield-Mask: 0x01) */
#define RTC_ALRMAR_MSK1                                                    RTC_ALRMAR_MSK1_Msk
#define RTC_ALRMAR_ST_Pos                                                  (4UL)    /*!<RTC ALRMAR: ST (Bit 4) */
#define RTC_ALRMAR_ST_Msk                                                  (0x70UL)   /*!< RTC ALRMAR: ST (Bitfield-Mask: 0x07) */
#define RTC_ALRMAR_ST                                                      RTC_ALRMAR_ST_Msk
#define RTC_ALRMAR_ST_0                                                    (0x1U << RTC_ALRMAR_ST_Pos)
#define RTC_ALRMAR_ST_1                                                    (0x2U << RTC_ALRMAR_ST_Pos)
#define RTC_ALRMAR_ST_2                                                    (0x4U << RTC_ALRMAR_ST_Pos)
#define RTC_ALRMAR_SU_Pos                                                  (0UL)    /*!<RTC ALRMAR: SU (Bit 0) */
#define RTC_ALRMAR_SU_Msk                                                  (0xfUL)    /*!< RTC ALRMAR: SU (Bitfield-Mask: 0x0f) */
#define RTC_ALRMAR_SU                                                      RTC_ALRMAR_SU_Msk
#define RTC_ALRMAR_SU_0                                                    (0x1U << RTC_ALRMAR_SU_Pos)
#define RTC_ALRMAR_SU_1                                                    (0x2U << RTC_ALRMAR_SU_Pos)
#define RTC_ALRMAR_SU_2                                                    (0x4U << RTC_ALRMAR_SU_Pos)
#define RTC_ALRMAR_SU_3                                                    (0x8U << RTC_ALRMAR_SU_Pos)

/* =====================================================    WPR    ===================================================== */
#define RTC_WPR_KEY_Pos                                                    (0UL)    /*!<RTC WPR: KEY (Bit 0) */
#define RTC_WPR_KEY_Msk                                                    (0xffUL)   /*!< RTC WPR: KEY (Bitfield-Mask: 0xff) */
#define RTC_WPR_KEY                                                        RTC_WPR_KEY_Msk
#define RTC_WPR_KEY_0                                                      (0x1U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_1                                                      (0x2U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_2                                                      (0x4U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_3                                                      (0x8U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_4                                                      (0x10U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_5                                                      (0x20U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_6                                                      (0x40U << RTC_WPR_KEY_Pos)
#define RTC_WPR_KEY_7                                                      (0x80U << RTC_WPR_KEY_Pos)

/* =====================================================    SSR    ===================================================== */
#define RTC_SSR_SS_Pos                                                     (0UL)    /*!<RTC SSR: SS (Bit 0) */
#define RTC_SSR_SS_Msk                                                     (0xffffUL)   /*!< RTC SSR: SS (Bitfield-Mask: 0xffff) */
#define RTC_SSR_SS                                                         RTC_SSR_SS_Msk
#define RTC_SSR_SS_0                                                       (0x1U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_1                                                       (0x2U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_2                                                       (0x4U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_3                                                       (0x8U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_4                                                       (0x10U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_5                                                       (0x20U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_6                                                       (0x40U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_7                                                       (0x80U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_8                                                       (0x100U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_9                                                       (0x200U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_10                                                      (0x400U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_11                                                      (0x800U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_12                                                      (0x1000U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_13                                                      (0x2000U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_14                                                      (0x4000U << RTC_SSR_SS_Pos)
#define RTC_SSR_SS_15                                                      (0x8000U << RTC_SSR_SS_Pos)

/* =====================================================    SHIFTR    ===================================================== */
#define RTC_SHIFTR_ADD1S_Pos                                               (31UL)   /*!<RTC SHIFTR: ADD1S (Bit 31) */
#define RTC_SHIFTR_ADD1S_Msk                                               (0x80000000UL)   /*!< RTC SHIFTR: ADD1S (Bitfield-Mask: 0x01) */
#define RTC_SHIFTR_ADD1S                                                   RTC_SHIFTR_ADD1S_Msk
#define RTC_SHIFTR_SUBFS_Pos                                               (0UL)    /*!<RTC SHIFTR: SUBFS (Bit 0) */
#define RTC_SHIFTR_SUBFS_Msk                                               (0x7fffUL)   /*!< RTC SHIFTR: SUBFS (Bitfield-Mask: 0x7fff) */
#define RTC_SHIFTR_SUBFS                                                   RTC_SHIFTR_SUBFS_Msk
#define RTC_SHIFTR_SUBFS_0                                                 (0x1U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_1                                                 (0x2U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_2                                                 (0x4U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_3                                                 (0x8U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_4                                                 (0x10U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_5                                                 (0x20U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_6                                                 (0x40U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_7                                                 (0x80U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_8                                                 (0x100U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_9                                                 (0x200U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_10                                                (0x400U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_11                                                (0x800U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_12                                                (0x1000U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_13                                                (0x2000U << RTC_SHIFTR_SUBFS_Pos)
#define RTC_SHIFTR_SUBFS_14                                                (0x4000U << RTC_SHIFTR_SUBFS_Pos)

