embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* Montgomery multiplication output data */
#define PKA_MONTGOMERY_MUL_OUT_RESULT             ((0x0E60U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* Generic Arithmetic input data */
#define PKA_ARITHMETIC_ALL_OPS_NB_BITS            ((0x0408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP1             ((0x0A40U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op1 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP2             ((0x0C50U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op2 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP3             ((0x01080U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op2 */

/* Generic Arithmetic output data */
#define PKA_ECC_DB_LADDER_IN_MOD_NB_BITS            ((0x0408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_ECC_DB_LADDER_IN_ORDER_NB_BITS          ((0x0400U - PKA_RAM_OFFSET)>>2)   /*!< Input order number of bits */
#define PKA_ECC_DB_LADDER_IN_A_COEFF_SIGN           ((0x0410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_DB_LADDER_IN_MOD_P                  ((0x0470U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus p */
#define PKA_ECC_DB_LADDER_IN_A_COEFF                ((0x0418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECC_DB_LADDER_IN_SCALAR_K               ((0x0520U - PKA_RAM_OFFSET)>>2)   /*!< Input operand scalar K */
#define PKA_ECC_DB_LADDER_IN_SCALAR_M               ((0x0578U - PKA_RAM_OFFSET)>>2)   /*!< Input operand scalar M */
#define PKA_ECC_DB_LADDER_IN_FIRST_POINT_X          ((0x0628U - PKA_RAM_OFFSET)>>2)   /*!< Input first point X coordinate */
#define PKA_ECC_DB_LADDER_IN_FIRST_POINT_Y          ((0x0680U - PKA_RAM_OFFSET)>>2)   /*!< Input first point Y coordinate */
#define PKA_ECC_DB_LADDER_IN_SECOND_POINT_X         ((0x0730U - PKA_RAM_OFFSET)>>2)   /*!< Input second point X coordinate */
#define PKA_ECC_DB_LADDER_IN_SECOND_POINT_Y         ((0x0788U - PKA_RAM_OFFSET)>>2)   /*!< Input second point Y coordinate */
#define PKA_ECC_DB_LADDER_OUT_ERROR                 ((0x0F80U - PKA_RAM_OFFSET)>>2)   /*!< Output error  */
#define PKA_ECC_DB_LADDER_OUT_RESULT_POINT_X        ((0x0578U - PKA_RAM_OFFSET)>>2)   /*!<  Output X coordinate */
#define PKA_ECC_DB_LADDER_OUT_RESULT_POINT_Y        ((0x05D0U - PKA_RAM_OFFSET)>>2)   /*!<  Output Y coordinate */

/* Generic Arithmetic output data */
#define PKA_ECC_COMPLETE_ADDITION_IN_MOD_NB_BITS            ((0x0408U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus number of bits */
#define PKA_ECC_COMPLETE_ADDITION_IN_A_COEFF_SIGN           ((0x0410U - PKA_RAM_OFFSET)>>2)   /*!< Input sign of the 'a' coefficient */
#define PKA_ECC_COMPLETE_ADDITION_IN_MOD_P                  ((0x0470U - PKA_RAM_OFFSET)>>2)   /*!< Input modulus p */
#define PKA_ECC_COMPLETE_ADDITION_IN_A_COEFF                ((0x0418U - PKA_RAM_OFFSET)>>2)   /*!< Input ECC curve 'a' coefficient */
#define PKA_ECC_COMPLETE_ADDITION_IN_FIRST_POINT_X          ((0x0628U - PKA_RAM_OFFSET)>>2)   /*!< Input first point X coordinate */
#define PKA_ECC_COMPLETE_ADDITION_IN_FIRST_POINT_Y          ((0x0680U - PKA_RAM_OFFSET)>>2)   /*!< Input first point Y coordinate */
#define PKA_ECC_COMPLETE_ADDITION_IN_FIRST_POINT_Z          ((0x06D8U - PKA_RAM_OFFSET)>>2)   /*!< Input first point Z coordinate */
#define PKA_ECC_COMPLETE_ADDITION_IN_SECOND_POINT_X         ((0x0730U - PKA_RAM_OFFSET)>>2)   /*!< Input second point X coordinate */
#define PKA_ECC_COMPLETE_ADDITION_IN_SECOND_POINT_Y         ((0x0788U - PKA_RAM_OFFSET)>>2)   /*!< Input second point Y coordinate */
#define PKA_ECC_COMPLETE_ADDITION_IN_SECOND_POINT_Z         ((0x07E0U - PKA_RAM_OFFSET)>>2)   /*!< Input second point Z coordinate */
#define PKA_ECC_COMPLETE_ADDITION_OUT_RESULT_POINT_X        ((0x0D60U - PKA_RAM_OFFSET)>>2)   /*!<  Output X coordinate */
#define PKA_ECC_COMPLETE_ADDITION_OUT_RESULT_POINT_Y        ((0x0DB8U - PKA_RAM_OFFSET)>>2)   /*!<  Output Y coordinate */
#define PKA_ECC_COMPLETE_ADDITION_OUT_RESULT_POINT_Z        ((0x0E10U - PKA_RAM_OFFSET)>>2)   /*!<  Output Z coordinate */


/* =========================================================================================================================== */
/*=====================                                       ADC                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    VERSION_ID    ===================================================== */
#define ADC_VERSION_ID_VERSION_ID_Pos                                      (0UL)    /*!<ADC VERSION_ID: VERSION_ID (Bit 0) */
#define ADC_VERSION_ID_VERSION_ID_Msk                                      (0xffUL)   /*!< ADC VERSION_ID: VERSION_ID (Bitfield-Mask: 0xff) */
#define ADC_VERSION_ID_VERSION_ID                                          ADC_VERSION_ID_VERSION_ID_Msk
#define ADC_VERSION_ID_VERSION_ID_0                                        (0x1U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_1                                        (0x2U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_2                                        (0x4U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_3                                        (0x8U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_4                                        (0x10U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_5                                        (0x20U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_6                                        (0x40U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_7                                        (0x80U << ADC_VERSION_ID_VERSION_ID_Pos)

/* =====================================================    CONF    ===================================================== */
#define ADC_CONF_SAMPLE_RATE_MSB_Pos                                       (21UL)   /*!<ADC CONF: SAMPLE_RATE_MSB (Bit 21) */
#define ADC_CONF_SAMPLE_RATE_MSB_Msk                                       (0xe00000UL)   /*!< ADC CONF: SAMPLE_RATE_MSB (Bitfield-Mask: 0x07) */
#define ADC_CONF_SAMPLE_RATE_MSB                                           ADC_CONF_SAMPLE_RATE_MSB_Msk
#define ADC_CONF_SAMPLE_RATE_MSB_0                                         (0x1U << ADC_CONF_SAMPLE_RATE_MSB_Pos)
#define ADC_CONF_SAMPLE_RATE_MSB_1                                         (0x2U << ADC_CONF_SAMPLE_RATE_MSB_Pos)
#define ADC_CONF_SAMPLE_RATE_MSB_2                                         (0x4U << ADC_CONF_SAMPLE_RATE_MSB_Pos)
#define ADC_CONF_ADC_CONT_1V2_Pos                                          (19UL)   /*!<ADC CONF: ADC_CONT_1V2 (Bit 19) */
#define ADC_CONF_ADC_CONT_1V2_Msk                                          (0x80000UL)    /*!< ADC CONF: ADC_CONT_1V2 (Bitfield-Mask: 0x01) */
#define ADC_CONF_ADC_CONT_1V2                                              ADC_CONF_ADC_CONT_1V2_Msk
#define ADC_CONF_BIT_INVERT_DIFF_Pos                                       (18UL)   /*!<ADC CONF: BIT_INVERT_DIFF (Bit 18) */
#define ADC_CONF_BIT_INVERT_DIFF_Msk                                       (0x40000UL)    /*!< ADC CONF: BIT_INVERT_DIFF (Bitfield-Mask: 0x01) */
#define ADC_CONF_BIT_INVERT_DIFF                                           ADC_CONF_BIT_INVERT_DIFF_Msk
#define ADC_CONF_BIT_INVERT_SN_Pos                                         (17UL)   /*!<ADC CONF: BIT_INVERT_SN (Bit 17) */
#define ADC_CONF_BIT_INVERT_SN_Msk                                         (0x20000UL)    /*!< ADC CONF: BIT_INVERT_SN (Bitfield-Mask: 0x01) */
#define ADC_CONF_BIT_INVERT_SN                                             ADC_CONF_BIT_INVERT_SN_Msk
#define ADC_CONF_OVR_DS_CFG_Pos                                            (15UL)   /*!<ADC CONF: OVR_DS_CFG (Bit 15) */
#define ADC_CONF_OVR_DS_CFG_Msk                                            (0x8000UL)   /*!< ADC CONF: OVR_DS_CFG (Bitfield-Mask: 0x01) */
#define ADC_CONF_OVR_DS_CFG                                                ADC_CONF_OVR_DS_CFG_Msk
#define ADC_CONF_DMA_DS_ENA_Pos                                            (13UL)   /*!<ADC CONF: DMA_DS_ENA (Bit 13) */
#define ADC_CONF_DMA_DS_ENA_Msk                                            (0x2000UL)   /*!< ADC CONF: DMA_DS_ENA (Bitfield-Mask: 0x01) */
#define ADC_CONF_DMA_DS_ENA                                                ADC_CONF_DMA_DS_ENA_Msk
#define ADC_CONF_SAMPLE_RATE_Pos                                           (11UL)   /*!<ADC CONF: SAMPLE_RATE (Bit 11) */
#define ADC_CONF_SAMPLE_RATE_Msk                                           (0x1800UL)   /*!< ADC CONF: SAMPLE_RATE (Bitfield-Mask: 0x03) */
#define ADC_CONF_SAMPLE_RATE                                               ADC_CONF_SAMPLE_RATE_Msk
#define ADC_CONF_SAMPLE_RATE_0                                             (0x1U << ADC_CONF_SAMPLE_RATE_Pos)
#define ADC_CONF_SAMPLE_RATE_1                                             (0x2U << ADC_CONF_SAMPLE_RATE_Pos)
#define ADC_CONF_SMPS_SYNCHRO_ENA_Pos                                      (6UL)    /*!<ADC CONF: SMPS_SYNCHRO_ENA (Bit 6) */
#define ADC_CONF_SMPS_SYNCHRO_ENA_Msk                                      (0x40UL)   /*!< ADC CONF: SMPS_SYNCHRO_ENA (Bitfield-Mask: 0x01) */
#define ADC_CONF_SMPS_SYNCHRO_ENA                                          ADC_CONF_SMPS_SYNCHRO_ENA_Msk
#define ADC_CONF_SEQ_LEN_Pos                                               (2UL)    /*!<ADC CONF: SEQ_LEN (Bit 2) */
#define ADC_CONF_SEQ_LEN_Msk                                               (0x3cUL)   /*!< ADC CONF: SEQ_LEN (Bitfield-Mask: 0x0f) */
#define ADC_CONF_SEQ_LEN                                                   ADC_CONF_SEQ_LEN_Msk
#define ADC_CONF_SEQ_LEN_0                                                 (0x1U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQ_LEN_1                                                 (0x2U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQ_LEN_2                                                 (0x4U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQ_LEN_3                                                 (0x8U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQUENCE_Pos                                              (1UL)    /*!<ADC CONF: SEQUENCE (Bit 1) */
#define ADC_CONF_SEQUENCE_Msk                                              (0x2UL)    /*!< ADC CONF: SEQUENCE (Bitfield-Mask: 0x01) */
#define ADC_CONF_SEQUENCE                                                  ADC_CONF_SEQUENCE_Msk
#define ADC_CONF_CONT_Pos                                                  (0UL)    /*!<ADC CONF: CONT (Bit 0) */
#define ADC_CONF_CONT_Msk                                                  (0x1UL)    /*!< ADC CONF: CONT (Bitfield-Mask: 0x01) */
#define ADC_CONF_CONT                                                      ADC_CONF_CONT_Msk

/* =====================================================    CTRL    ===================================================== */
#define ADC_CTRL_ADC_LDO_ENA_Pos                                           (5UL)    /*!<ADC CTRL: ADC_LDO_ENA (Bit 5) */
#define ADC_CTRL_ADC_LDO_ENA_Msk                                           (0x20UL)   /*!< ADC CTRL: ADC_LDO_ENA (Bitfield-Mask: 0x01) */
#define ADC_CTRL_ADC_LDO_ENA                                               ADC_CTRL_ADC_LDO_ENA_Msk
#define ADC_CTRL_TEST_MODE_Pos                                             (4UL)    /*!<ADC CTRL: TEST_MODE (Bit 4) */
#define ADC_CTRL_TEST_MODE_Msk                                             (0x10UL)   /*!< ADC CTRL: TEST_MODE (Bitfield-Mask: 0x01) */
#define ADC_CTRL_TEST_MODE                                                 ADC_CTRL_TEST_MODE_Msk
#define ADC_CTRL_STOP_OP_MODE_Pos                                          (2UL)    /*!<ADC CTRL: STOP_OP_MODE (Bit 2) */
#define ADC_CTRL_STOP_OP_MODE_Msk                                          (0x4UL)    /*!< ADC CTRL: STOP_OP_MODE (Bitfield-Mask: 0x01) */
#define ADC_CTRL_STOP_OP_MODE                                              ADC_CTRL_STOP_OP_MODE_Msk
#define ADC_CTRL_START_CONV_Pos                                            (1UL)    /*!<ADC CTRL: START_CONV (Bit 1) */
#define ADC_CTRL_START_CONV_Msk                                            (0x2UL)    /*!< ADC CTRL: START_CONV (Bitfield-Mask: 0x01) */
#define ADC_CTRL_START_CONV                                                ADC_CTRL_START_CONV_Msk
#define ADC_CTRL_ADC_ON_OFF_Pos                                            (0UL)    /*!<ADC CTRL: ADC_ON_OFF (Bit 0) */
#define ADC_CTRL_ADC_ON_OFF_Msk                                            (0x1UL)    /*!< ADC CTRL: ADC_ON_OFF (Bitfield-Mask: 0x01) */
#define ADC_CTRL_ADC_ON_OFF                                                ADC_CTRL_ADC_ON_OFF_Msk

/* =====================================================    SWITCH    ===================================================== */
#define ADC_SWITCH_SE_VIN_7_Pos                                            (14UL)   /*!<ADC SWITCH: SE_VIN_7 (Bit 14) */
#define ADC_SWITCH_SE_VIN_7_Msk                                            (0xc000UL)   /*!< ADC SWITCH: SE_VIN_7 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_7                                                ADC_SWITCH_SE_VIN_7_Msk
#define ADC_SWITCH_SE_VIN_7_0                                              (0x1U << ADC_SWITCH_SE_VIN_7_Pos)
#define ADC_SWITCH_SE_VIN_7_1                                              (0x2U << ADC_SWITCH_SE_VIN_7_Pos)
#define ADC_SWITCH_SE_VIN_6_Pos                                            (12UL)   /*!<ADC SWITCH: SE_VIN_6 (Bit 12) */
#define ADC_SWITCH_SE_VIN_6_Msk                                            (0x3000UL)   /*!< ADC SWITCH: SE_VIN_6 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_6                                                ADC_SWITCH_SE_VIN_6_Msk
#define ADC_SWITCH_SE_VIN_6_0                                              (0x1U << ADC_SWITCH_SE_VIN_6_Pos)
#define ADC_SWITCH_SE_VIN_6_1                                              (0x2U << ADC_SWITCH_SE_VIN_6_Pos)
#define ADC_SWITCH_SE_VIN_5_Pos                                            (10UL)   /*!<ADC SWITCH: SE_VIN_5 (Bit 10) */
#define ADC_SWITCH_SE_VIN_5_Msk                                            (0xc00UL)    /*!< ADC SWITCH: SE_VIN_5 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_5                                                ADC_SWITCH_SE_VIN_5_Msk
#define ADC_SWITCH_SE_VIN_5_0                                              (0x1U << ADC_SWITCH_SE_VIN_5_Pos)
#define ADC_SWITCH_SE_VIN_5_1                                              (0x2U << ADC_SWITCH_SE_VIN_5_Pos)
#define ADC_SWITCH_SE_VIN_4_Pos                                            (8UL)    /*!<ADC SWITCH: SE_VIN_4 (Bit 8) */
#define ADC_SWITCH_SE_VIN_4_Msk                                            (0x300UL)    /*!< ADC SWITCH: SE_VIN_4 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_4                                                ADC_SWITCH_SE_VIN_4_Msk
#define ADC_SWITCH_SE_VIN_4_0                                              (0x1U << ADC_SWITCH_SE_VIN_4_Pos)
#define ADC_SWITCH_SE_VIN_4_1                                              (0x2U << ADC_SWITCH_SE_VIN_4_Pos)
#define ADC_SWITCH_SE_VIN_3_Pos                                            (6UL)    /*!<ADC SWITCH: SE_VIN_3 (Bit 6) */
#define ADC_SWITCH_SE_VIN_3_Msk                                            (0xc0UL)   /*!< ADC SWITCH: SE_VIN_3 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_3                                                ADC_SWITCH_SE_VIN_3_Msk
#define ADC_SWITCH_SE_VIN_3_0                                              (0x1U << ADC_SWITCH_SE_VIN_3_Pos)
#define ADC_SWITCH_SE_VIN_3_1                                              (0x2U << ADC_SWITCH_SE_VIN_3_Pos)
#define ADC_SWITCH_SE_VIN_2_Pos                                            (4UL)    /*!<ADC SWITCH: SE_VIN_2 (Bit 4) */
#define ADC_SWITCH_SE_VIN_2_Msk                                            (0x30UL)   /*!< ADC SWITCH: SE_VIN_2 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_2                                                ADC_SWITCH_SE_VIN_2_Msk
#define ADC_SWITCH_SE_VIN_2_0                                              (0x1U << ADC_SWITCH_SE_VIN_2_Pos)
#define ADC_SWITCH_SE_VIN_2_1                                              (0x2U << ADC_SWITCH_SE_VIN_2_Pos)
#define ADC_SWITCH_SE_VIN_1_Pos                                            (2UL)    /*!<ADC SWITCH: SE_VIN_1 (Bit 2) */
#define ADC_SWITCH_SE_VIN_1_Msk                                            (0xcUL)    /*!< ADC SWITCH: SE_VIN_1 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_1                                                ADC_SWITCH_SE_VIN_1_Msk
#define ADC_SWITCH_SE_VIN_1_0                                              (0x1U << ADC_SWITCH_SE_VIN_1_Pos)
#define ADC_SWITCH_SE_VIN_1_1                                              (0x2U << ADC_SWITCH_SE_VIN_1_Pos)
#define ADC_SWITCH_SE_VIN_0_Pos                                            (0UL)    /*!<ADC SWITCH: SE_VIN_0 (Bit 0) */
#define ADC_SWITCH_SE_VIN_0_Msk                                            (0x3UL)    /*!< ADC SWITCH: SE_VIN_0 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_0                                                ADC_SWITCH_SE_VIN_0_Msk
#define ADC_SWITCH_SE_VIN_0_0                                              (0x1U << ADC_SWITCH_SE_VIN_0_Pos)
#define ADC_SWITCH_SE_VIN_0_1                                              (0x2U << ADC_SWITCH_SE_VIN_0_Pos)

