embassy-rs/stm32-data-sources/headers/stm32wb09xx.h
/* =====================================================    STATISTICS_RESTART    =====================================================*/
#define WAKEUP_STATISTICS_RESTART_CLR_AVR_Pos                              (1UL)    /*!<WAKEUP STATISTICS_RESTART: CLR_AVR (Bit 1) */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR_Msk                              (0x2UL)    /*!< WAKEUP STATISTICS_RESTART: CLR_AVR (Bitfield-Mask: 0x01) */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR                                  WAKEUP_STATISTICS_RESTART_CLR_AVR_Msk
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Pos                          (0UL)    /*!<WAKEUP STATISTICS_RESTART: CLR_MIN_MAX (Bit 0) */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Msk                          (0x1UL)    /*!< WAKEUP STATISTICS_RESTART: CLR_MIN_MAX (Bitfield-Mask: 0x01) */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX                              WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Msk

/* =====================================================    BLUE_WAKEUP_TIME    =====================================================*/
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos                            (0UL)    /*!<WAKEUP BLUE_WAKEUP_TIME: WAKEUP_TIME (Bit 0) */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Msk                            (0xffffffffUL)   /*!< WAKEUP BLUE_WAKEUP_TIME: WAKEUP_TIME (Bitfield-Mask: 0xffffffff) */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME                                WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Msk
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_0                              (0x1U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_1                              (0x2U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_2                              (0x4U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_3                              (0x8U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_4                              (0x10U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_5                              (0x20U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_6                              (0x40U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_7                              (0x80U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_8                              (0x100U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_9                              (0x200U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_10                             (0x400U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_11                             (0x800U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_12                             (0x1000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_13                             (0x2000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_14                             (0x4000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_15                             (0x8000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_16                             (0x10000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_17                             (0x20000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_18                             (0x40000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_19                             (0x80000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_20                             (0x100000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_21                             (0x200000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_22                             (0x400000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_23                             (0x800000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_24                             (0x1000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_25                             (0x2000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_26                             (0x4000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_27                             (0x8000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_28                             (0x10000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_29                             (0x20000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_30                             (0x40000000U << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_31                             (0x80000000UL << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)

/* =====================================================    BLUE_SLEEP_REQUEST_MODE    =====================================================*/
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Pos                  (31UL)   /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bit 31) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk                  (0x80000000UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bitfield-Mask: 0x01) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING                      WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Pos                   (30UL)   /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: BLE_WAKEUP_EN (Bit 30) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Msk                   (0x40000000UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: BLE_WAKEUP_EN (Bitfield-Mask: 0x01) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN                       WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Pos                        (29UL)   /*!<WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_EN (Bit 29) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Msk                        (0x20000000UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_EN (Bitfield-Mask: 0x01) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN                            WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Msk

/* =====================================================    CM0_WAKEUP_TIME    =====================================================*/
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos                             (4UL)    /*!<WAKEUP CM0_WAKEUP_TIME: WAKEUP_TIME (Bit 4) */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Msk                             (0xfffffff0UL)   /*!< WAKEUP CM0_WAKEUP_TIME: WAKEUP_TIME (Bitfield-Mask: 0xfffffff) */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME                                 WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Msk
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_0                               (0x1U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_1                               (0x2U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_2                               (0x4U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_3                               (0x8U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_4                               (0x10U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_5                               (0x20U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_6                               (0x40U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_7                               (0x80U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_8                               (0x100U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_9                               (0x200U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_10                              (0x400U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_11                              (0x800U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_12                              (0x1000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_13                              (0x2000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_14                              (0x4000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_15                              (0x8000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_16                              (0x10000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_17                              (0x20000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_18                              (0x40000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_19                              (0x80000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_20                              (0x100000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_21                              (0x200000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_22                              (0x400000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_23                              (0x800000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_24                              (0x1000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_25                              (0x2000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_26                              (0x4000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_27                              (0x8000000U << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)

/* =====================================================    CM0_SLEEP_REQUEST_MODE    =====================================================*/
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Pos                   (31UL)   /*!<WAKEUP CM0_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bit 31) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk                   (0x80000000UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bitfield-Mask: 0x01) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING                       WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Pos                    (30UL)   /*!<WAKEUP CM0_SLEEP_REQUEST_MODE: CPU_WAKEUP_EN (Bit 30) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Msk                    (0x40000000UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: CPU_WAKEUP_EN (Bitfield-Mask: 0x01) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN                        WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Msk

/* =====================================================    WAKEUP_BLE_IRQ_ENABLE    =====================================================*/
#define WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT_Pos                         (0UL)    /*!<WAKEUP WAKEUP_BLE_IRQ_ENABLE: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT_Msk                         (0x1UL)    /*!< WAKEUP WAKEUP_BLE_IRQ_ENABLE: WAKEUP_IT (Bitfield-Mask: 0x01) */
#define WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT                             WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT_Msk

